const guaFullName = ["坤为地", "地雷复", "地水师", "地泽临", "地山谦", "地火明夷", "地风升", "地天泰",
    "雷地豫", "震为雷", "雷水解", "雷泽归妹", "雷山小过", "雷火丰", "雷风恒", "雷天大壮", "水地比", "云雷屯", "坎为水", "水泽节", "水山蹇", "水火既济", "水风井",
    "水天需", "泽地萃", "泽雷随", "泽水困", "兑为泽", "泽山咸", "泽炎革", "泽风大过", "泽天夬", "山地剥", "山雷颐", "山水蒙", "山泽损", "艮为山", "山火贲",
    "山风蛊", "山天大畜", "火地晋", "火雷噬嗑", "火水未济", "火泽睽", "火山旅", "离为火", "火风鼎", "火天大有", "风地观", "风雷益", "风水涣", "风泽中孚",
    "风山渐", "风火家人", "巽为风", "风天小畜", "天地否", "天雷无妄", "天水讼", "天泽履", "天山遁", "天火同人", "天风垢", "乾为天"
]
const guaName = ["坤", "复", "师", "临", "谦", "明夷", "升", "泰", "豫", "震", "解", "归妹",
    "小过", "丰", "恒", "大壮", "比", "屯", "坎", "节", "蹇", "既济", "井", "需", "萃", "随", "困", "兑", "咸", "革", "大过", "夬", "剥",
    "颐", "蒙", "损", "艮", "贲", "蛊", "大畜", "晋", "噬嗑", "未济", "睽", "旅", "离", "鼎", "大有", "观", "益", "涣", "中孚", "渐",
    "家人", "巽", "小畜", "否", "无妄", "讼", "履", "遁", "同人", "姤", "乾"
]
const guaNameT = ["坤", "複", "師", "臨", "謙", "明夷", "昇", "泰", "豫", "震", "解", "歸妹",
    "小過", "豐", "恒", "大壯", "比", "屯", "坎", "節", "蹇", "既濟", "井", "需", "萃", "隨", "困", "兌", "鹹", "革", "大過", "夬", "剝",
    "頤", "蒙", "損", "艮", "賁", "蠱", "大畜", "晋", "噬嗑", "未濟", "睽", "旅", "離", "鼎", "大有", "觀", "益", "渙", "中孚", "漸",
    "家人", "巽", "小畜", "否", "無妄", "訟", "履", "遁", "同人", "姤", "乾"
]
const zhouyiGuas = [63, 0, 17, 34, 23, 58, 2, 16, 55, 59, 7, 56, 61, 47, 4, 8, 25, 38, 3, 48, 41, 37, 32, 1, 57, 39, 33, 30, 18, 45, 28, 14, 60, 15, 40, 5, 53, 43, 20, 10, 35, 49, 31, 62, 24, 6, 26, 22, 29, 46, 9, 36, 52, 11, 13, 44, 54, 27, 50, 19, 51, 12, 21, 42]
const s = "万与丑专业丛东丝丢两严丧个丬丰临为丽举么义乌乐乔习乡书买乱争于亏云亘亚产亩亲亵亸亿仅从仑仓仪们价众优伙会伛伞伟传伤伥伦伧伪伫体余佣佥侠侣侥侦侧侨侩侪侬俣俦俨俩俪俭债倾偬偻偾偿傥傧储傩儿兑兖党兰关兴兹养兽冁内冈册写军农冢冯冲决况冻净凄凉凌减凑凛几凤凫凭凯击凼凿刍划刘则刚创删别刬刭刽刿剀剂剐剑剥剧劝办务劢动励劲劳势勋勐勚匀匦匮区医华协单卖卢卤卧卫却卺厂厅历厉压厌厍厕厢厣厦厨厩厮县参叆叇双发变叙叠叶号叹叽吁后吓吕吗吣吨听启吴呒呓呕呖呗员呙呛呜咏咔咙咛咝咤咴咸哌响哑哒哓哔哕哗哙哜哝哟唛唝唠唡唢唣唤唿啧啬啭啮啰啴啸喷喽喾嗫呵嗳嘘嘤嘱噜噼嚣嚯团园囱围囵国图圆圣圹场坂坏块坚坛坜坝坞坟坠垄垅垆垒垦垧垩垫垭垯垱垲垴埘埙埚埝埯堑堕塆墙壮声壳壶壸处备复够头夸夹夺奁奂奋奖奥妆妇妈妩妪妫姗姜娄娅娆娇娈娱娲娴婳婴婵婶媪嫒嫔嫱嬷孙学孪宁宝实宠审宪宫宽宾寝对寻导寿将尔尘尧尴尸尽层屃屉届属屡屦屿岁岂岖岗岘岙岚岛岭岳岽岿峃峄峡峣峤峥峦崂崃崄崭嵘嵚嵛嵝嵴巅巩巯币帅师帏帐帘帜带帧帮帱帻帼幂幞干并广庄庆庐庑库应庙庞废庼廪开异弃张弥弪弯弹强归当录彟彦彻径徕御忆忏忧忾怀态怂怃怄怅怆怜总怼怿恋恳恶恸恹恺恻恼恽悦悫悬悭悯惊惧惨惩惫惬惭惮惯愍愠愤愦愿慑慭憷懑懒懔戆戋戏戗战戬户扎扑扦执扩扪扫扬扰抚抛抟抠抡抢护报担拟拢拣拥拦拧拨择挂挚挛挜挝挞挟挠挡挢挣挤挥挦捞损捡换捣据捻掳掴掷掸掺掼揸揽揿搀搁搂搅携摄摅摆摇摈摊撄撑撵撷撸撺擞攒敌敛数斋斓斗斩断无旧时旷旸昙昼昽显晋晒晓晔晕晖暂暧札术朴机杀杂权条来杨杩杰极构枞枢枣枥枧枨枪枫枭柜柠柽栀栅标栈栉栊栋栌栎栏树栖样栾桊桠桡桢档桤桥桦桧桨桩梦梼梾检棂椁椟椠椤椭楼榄榇榈榉槚槛槟槠横樯樱橥橱橹橼檐檩欢欤欧歼殁殇残殒殓殚殡殴毁毂毕毙毡毵氇气氢氩氲汇汉污汤汹沓沟没沣沤沥沦沧沨沩沪沵泞泪泶泷泸泺泻泼泽泾洁洒洼浃浅浆浇浈浉浊测浍济浏浐浑浒浓浔浕涂涌涛涝涞涟涠涡涢涣涤润涧涨涩淀渊渌渍渎渐渑渔渖渗温游湾湿溃溅溆溇滗滚滞滟滠满滢滤滥滦滨滩滪漤潆潇潋潍潜潴澜濑濒灏灭灯灵灾灿炀炉炖炜炝点炼炽烁烂烃烛烟烦烧烨烩烫烬热焕焖焘煅煳熘爱爷牍牦牵牺犊犟状犷犸犹狈狍狝狞独狭狮狯狰狱狲猃猎猕猡猪猫猬献獭玑玙玚玛玮环现玱玺珉珏珐珑珰珲琎琏琐琼瑶瑷璇璎瓒瓮瓯电画畅畲畴疖疗疟疠疡疬疮疯疱疴痈痉痒痖痨痪痫痴瘅瘆瘗瘘瘪瘫瘾瘿癞癣癫癯皑皱皲盏盐监盖盗盘眍眦眬着睁睐睑瞒瞩矫矶矾矿砀码砖砗砚砜砺砻砾础硁硅硕硖硗硙硚确硷碍碛碜碱碹磙礼祎祢祯祷祸禀禄禅离秃秆种积称秽秾稆税稣稳穑穷窃窍窑窜窝窥窦窭竖竞笃笋笔笕笺笼笾筑筚筛筜筝筹签简箓箦箧箨箩箪箫篑篓篮篱簖籁籴类籼粜粝粤粪粮糁糇紧絷纟纠纡红纣纤纥约级纨纩纪纫纬纭纮纯纰纱纲纳纴纵纶纷纸纹纺纻纼纽纾线绀绁绂练组绅细织终绉绊绋绌绍绎经绐绑绒结绔绕绖绗绘给绚绛络绝绞统绠绡绢绣绤绥绦继绨绩绪绫绬续绮绯绰绱绲绳维绵绶绷绸绹绺绻综绽绾绿缀缁缂缃缄缅缆缇缈缉缊缋缌缍缎缏缐缑缒缓缔缕编缗缘缙缚缛缜缝缞缟缠缡缢缣缤缥缦缧缨缩缪缫缬缭缮缯缰缱缲缳缴缵罂网罗罚罢罴羁羟羡翘翙翚耢耧耸耻聂聋职聍联聩聪肃肠肤肷肾肿胀胁胆胜胧胨胪胫胶脉脍脏脐脑脓脔脚脱脶脸腊腌腘腭腻腼腽腾膑臜舆舣舰舱舻艰艳艹艺节芈芗芜芦苁苇苈苋苌苍苎苏苘苹茎茏茑茔茕茧荆荐荙荚荛荜荞荟荠荡荣荤荥荦荧荨荩荪荫荬荭荮药莅莜莱莲莳莴莶获莸莹莺莼萚萝萤营萦萧萨葱蒇蒉蒋蒌蓝蓟蓠蓣蓥蓦蔷蔹蔺蔼蕲蕴薮藁藓虏虑虚虫虬虮虽虾虿蚀蚁蚂蚕蚝蚬蛊蛎蛏蛮蛰蛱蛲蛳蛴蜕蜗蜡蝇蝈蝉蝎蝼蝾螀螨蟏衅衔补衬衮袄袅袆袜袭袯装裆裈裢裣裤裥褛褴襁襕见观觃规觅视觇览觉觊觋觌觍觎觏觐觑觞触觯詟誉誊讠计订讣认讥讦讧讨让讪讫训议讯记讱讲讳讴讵讶讷许讹论讻讼讽设访诀证诂诃评诅识诇诈诉诊诋诌词诎诏诐译诒诓诔试诖诗诘诙诚诛诜话诞诟诠诡询诣诤该详诧诨诩诪诫诬语诮误诰诱诲诳说诵诶请诸诹诺读诼诽课诿谀谁谂调谄谅谆谇谈谊谋谌谍谎谏谐谑谒谓谔谕谖谗谘谙谚谛谜谝谞谟谠谡谢谣谤谥谦谧谨谩谪谫谬谭谮谯谰谱谲谳谴谵谶谷豮贝贞负贠贡财责贤败账货质贩贪贫贬购贮贯贰贱贲贳贴贵贶贷贸费贺贻贼贽贾贿赀赁赂赃资赅赆赇赈赉赊赋赌赍赎赏赐赑赒赓赔赕赖赗赘赙赚赛赜赝赞赟赠赡赢赣赪赵赶趋趱趸跃跄跖跞践跶跷跸跹跻踊踌踪踬踯蹑蹒蹰蹿躏躜躯车轧轨轩轪轫转轭轮软轰轱轲轳轴轵轶轷轸轹轺轻轼载轾轿辀辁辂较辄辅辆辇辈辉辊辋辌辍辎辏辐辑辒输辔辕辖辗辘辙辚辞辩辫边辽达迁过迈运还这进远违连迟迩迳迹适选逊递逦逻遗遥邓邝邬邮邹邺邻郁郄郏郐郑郓郦郧郸酝酦酱酽酾酿释里鉅鉴銮錾钆钇针钉钊钋钌钍钎钏钐钑钒钓钔钕钖钗钘钙钚钛钝钞钟钠钡钢钣钤钥钦钧钨钩钪钫钬钭钮钯钰钱钲钳钴钵钶钷钸钹钺钻钼钽钾钿铀铁铂铃铄铅铆铈铉铊铋铍铎铏铐铑铒铕铗铘铙铚铛铜铝铞铟铠铡铢铣铤铥铦铧铨铪铫铬铭铮铯铰铱铲铳铴铵银铷铸铹铺铻铼铽链铿销锁锂锃锄锅锆锇锈锉锊锋锌锍锎锏锐锑锒锓锔锕锖锗错锚锜锞锟锠锡锢锣锤锥锦锨锩锫锬锭键锯锰锱锲锳锴锵锶锷锸锹锺锻锼锽锾锿镀镁镂镃镆镇镈镉镊镌镍镎镏镐镑镒镕镖镗镙镚镛镜镝镞镟镠镡镢镣镤镥镦镧镨镩镪镫镬镭镮镯镰镱镲镳镴镶长门闩闪闫闬闭问闯闰闱闲闳间闵闶闷闸闹闺闻闼闽闾闿阀阁阂阃阄阅阆阇阈阉阊阋阌阍阎阏阐阑阒阓阔阕阖阗阘阙阚阛队阳阴阵阶际陆陇陈陉陕陧陨险随隐隶隽难雏雠雳雾霁霉霭靓静靥鞑鞒鞯鞴韦韧韨韩韪韫韬韵页顶顷顸项顺须顼顽顾顿颀颁颂颃预颅领颇颈颉颊颋颌颍颎颏颐频颒颓颔颕颖颗题颙颚颛颜额颞颟颠颡颢颣颤颥颦颧风飏飐飑飒飓飔飕飖飗飘飙飚飞飨餍饤饥饦饧饨饩饪饫饬饭饮饯饰饱饲饳饴饵饶饷饸饹饺饻饼饽饾饿馀馁馂馃馄馅馆馇馈馉馊馋馌馍馎馏馐馑馒馓馔馕马驭驮驯驰驱驲驳驴驵驶驷驸驹驺驻驼驽驾驿骀骁骂骃骄骅骆骇骈骉骊骋验骍骎骏骐骑骒骓骔骕骖骗骘骙骚骛骜骝骞骟骠骡骢骣骤骥骦骧髅髋髌鬓魇魉鱼鱽鱾鱿鲀鲁鲂鲄鲅鲆鲇鲈鲉鲊鲋鲌鲍鲎鲏鲐鲑鲒鲓鲔鲕鲖鲗鲘鲙鲚鲛鲜鲝鲞鲟鲠鲡鲢鲣鲤鲥鲦鲧鲨鲩鲪鲫鲬鲭鲮鲯鲰鲱鲲鲳鲴鲵鲶鲷鲸鲹鲺鲻鲼鲽鲾鲿鳀鳁鳂鳃鳄鳅鳆鳇鳈鳉鳊鳋鳌鳍鳎鳏鳐鳑鳒鳓鳔鳕鳖鳗鳘鳙鳛鳜鳝鳞鳟鳠鳡鳢鳣鸟鸠鸡鸢鸣鸤鸥鸦鸧鸨鸩鸪鸫鸬鸭鸮鸯鸰鸱鸲鸳鸴鸵鸶鸷鸸鸹鸺鸻鸼鸽鸾鸿鹀鹁鹂鹃鹄鹅鹆鹇鹈鹉鹊鹋鹌鹍鹎鹏鹐鹑鹒鹓鹔鹕鹖鹗鹘鹚鹛鹜鹝鹞鹟鹠鹡鹢鹣鹤鹥鹦鹧鹨鹩鹪鹫鹬鹭鹯鹰鹱鹲鹳鹴鹾麦麸黄黉黡黩黪黾鼋鼌鼍鼗鼹齄齐齑齿龀龁龂龃龄龅龆龇龈龉龊龋龌龙龚龛龟志制咨只里系范松没尝尝闹面准钟别闲干尽脏拼";
const t = "萬與醜專業叢東絲丟兩嚴喪個爿豐臨為麗舉麼義烏樂喬習鄉書買亂爭於虧雲亙亞產畝親褻嚲億僅從侖倉儀們價眾優夥會傴傘偉傳傷倀倫傖偽佇體餘傭僉俠侶僥偵側僑儈儕儂俁儔儼倆儷儉債傾傯僂僨償儻儐儲儺兒兌兗黨蘭關興茲養獸囅內岡冊寫軍農塚馮衝決況凍淨淒涼淩減湊凜幾鳳鳧憑凱擊氹鑿芻劃劉則剛創刪別剗剄劊劌剴劑剮劍剝劇勸辦務勱動勵勁勞勢勳猛勩勻匭匱區醫華協單賣盧鹵臥衛卻巹廠廳曆厲壓厭厙廁廂厴廈廚廄廝縣參靉靆雙發變敘疊葉號歎嘰籲後嚇呂嗎唚噸聽啟吳嘸囈嘔嚦唄員咼嗆嗚詠哢嚨嚀噝吒噅鹹呱響啞噠嘵嗶噦嘩噲嚌噥喲嘜嗊嘮啢嗩唕喚呼嘖嗇囀齧囉嘽嘯噴嘍嚳囁嗬噯噓嚶囑嚕劈囂謔團園囪圍圇國圖圓聖壙場阪壞塊堅壇壢壩塢墳墜壟壟壚壘墾坰堊墊埡墶壋塏堖塒塤堝墊垵塹墮壪牆壯聲殼壺壼處備複夠頭誇夾奪奩奐奮獎奧妝婦媽嫵嫗媯姍薑婁婭嬈嬌孌娛媧嫻嫿嬰嬋嬸媼嬡嬪嬙嬤孫學孿寧寶實寵審憲宮寬賓寢對尋導壽將爾塵堯尷屍盡層屭屜屆屬屢屨嶼歲豈嶇崗峴嶴嵐島嶺嶽崠巋嶨嶧峽嶢嶠崢巒嶗崍嶮嶄嶸嶔崳嶁脊巔鞏巰幣帥師幃帳簾幟帶幀幫幬幘幗冪襆幹並廣莊慶廬廡庫應廟龐廢廎廩開異棄張彌弳彎彈強歸當錄彠彥徹徑徠禦憶懺憂愾懷態慫憮慪悵愴憐總懟懌戀懇惡慟懨愷惻惱惲悅愨懸慳憫驚懼慘懲憊愜慚憚慣湣慍憤憒願懾憖怵懣懶懍戇戔戲戧戰戩戶紮撲扡執擴捫掃揚擾撫拋摶摳掄搶護報擔擬攏揀擁攔擰撥擇掛摯攣掗撾撻挾撓擋撟掙擠揮撏撈損撿換搗據撚擄摑擲撣摻摜摣攬撳攙擱摟攪攜攝攄擺搖擯攤攖撐攆擷擼攛擻攢敵斂數齋斕鬥斬斷無舊時曠暘曇晝曨顯晉曬曉曄暈暉暫曖劄術樸機殺雜權條來楊榪傑極構樅樞棗櫪梘棖槍楓梟櫃檸檉梔柵標棧櫛櫳棟櫨櫟欄樹棲樣欒棬椏橈楨檔榿橋樺檜槳樁夢檮棶檢欞槨櫝槧欏橢樓欖櫬櫚櫸檟檻檳櫧橫檣櫻櫫櫥櫓櫞簷檁歡歟歐殲歿殤殘殞殮殫殯毆毀轂畢斃氈毿氌氣氫氬氳彙漢汙湯洶遝溝沒灃漚瀝淪滄渢溈滬濔濘淚澩瀧瀘濼瀉潑澤涇潔灑窪浹淺漿澆湞溮濁測澮濟瀏滻渾滸濃潯濜塗湧濤澇淶漣潿渦溳渙滌潤澗漲澀澱淵淥漬瀆漸澠漁瀋滲溫遊灣濕潰濺漵漊潷滾滯灩灄滿瀅濾濫灤濱灘澦濫瀠瀟瀲濰潛瀦瀾瀨瀕灝滅燈靈災燦煬爐燉煒熗點煉熾爍爛烴燭煙煩燒燁燴燙燼熱煥燜燾煆糊溜愛爺牘犛牽犧犢強狀獷獁猶狽麅獮獰獨狹獅獪猙獄猻獫獵獼玀豬貓蝟獻獺璣璵瑒瑪瑋環現瑲璽瑉玨琺瓏璫琿璡璉瑣瓊瑤璦璿瓔瓚甕甌電畫暢佘疇癤療瘧癘瘍鬁瘡瘋皰屙癰痙癢瘂癆瘓癇癡癉瘮瘞瘺癟癱癮癭癩癬癲臒皚皺皸盞鹽監蓋盜盤瞘眥矓著睜睞瞼瞞矚矯磯礬礦碭碼磚硨硯碸礪礱礫礎硜矽碩硤磽磑礄確鹼礙磧磣堿镟滾禮禕禰禎禱禍稟祿禪離禿稈種積稱穢穠穭稅穌穩穡窮竊竅窯竄窩窺竇窶豎競篤筍筆筧箋籠籩築篳篩簹箏籌簽簡籙簀篋籜籮簞簫簣簍籃籬籪籟糴類秈糶糲粵糞糧糝餱緊縶糸糾紆紅紂纖紇約級紈纊紀紉緯紜紘純紕紗綱納紝縱綸紛紙紋紡紵紖紐紓線紺絏紱練組紳細織終縐絆紼絀紹繹經紿綁絨結絝繞絰絎繪給絢絳絡絕絞統綆綃絹繡綌綏絛繼綈績緒綾緓續綺緋綽緔緄繩維綿綬繃綢綯綹綣綜綻綰綠綴緇緙緗緘緬纜緹緲緝縕繢緦綞緞緶線緱縋緩締縷編緡緣縉縛縟縝縫縗縞纏縭縊縑繽縹縵縲纓縮繆繅纈繚繕繒韁繾繰繯繳纘罌網羅罰罷羆羈羥羨翹翽翬耮耬聳恥聶聾職聹聯聵聰肅腸膚膁腎腫脹脅膽勝朧腖臚脛膠脈膾髒臍腦膿臠腳脫腡臉臘醃膕齶膩靦膃騰臏臢輿艤艦艙艫艱豔艸藝節羋薌蕪蘆蓯葦藶莧萇蒼苧蘇檾蘋莖蘢蔦塋煢繭荊薦薘莢蕘蓽蕎薈薺蕩榮葷滎犖熒蕁藎蓀蔭蕒葒葤藥蒞蓧萊蓮蒔萵薟獲蕕瑩鶯蓴蘀蘿螢營縈蕭薩蔥蕆蕢蔣蔞藍薊蘺蕷鎣驀薔蘞藺藹蘄蘊藪槁蘚虜慮虛蟲虯蟣雖蝦蠆蝕蟻螞蠶蠔蜆蠱蠣蟶蠻蟄蛺蟯螄蠐蛻蝸蠟蠅蟈蟬蠍螻蠑螿蟎蠨釁銜補襯袞襖嫋褘襪襲襏裝襠褌褳襝褲襇褸襤繈襴見觀覎規覓視覘覽覺覬覡覿覥覦覯覲覷觴觸觶讋譽謄訁計訂訃認譏訐訌討讓訕訖訓議訊記訒講諱謳詎訝訥許訛論訩訟諷設訪訣證詁訶評詛識詗詐訴診詆謅詞詘詔詖譯詒誆誄試詿詩詰詼誠誅詵話誕詬詮詭詢詣諍該詳詫諢詡譸誡誣語誚誤誥誘誨誑說誦誒請諸諏諾讀諑誹課諉諛誰諗調諂諒諄誶談誼謀諶諜謊諫諧謔謁謂諤諭諼讒諮諳諺諦謎諞諝謨讜謖謝謠謗諡謙謐謹謾謫譾謬譚譖譙讕譜譎讞譴譫讖穀豶貝貞負貟貢財責賢敗賬貨質販貪貧貶購貯貫貳賤賁貰貼貴貺貸貿費賀貽賊贄賈賄貲賃賂贓資賅贐賕賑賚賒賦賭齎贖賞賜贔賙賡賠賧賴賵贅賻賺賽賾贗讚贇贈贍贏贛赬趙趕趨趲躉躍蹌蹠躒踐躂蹺蹕躚躋踴躊蹤躓躑躡蹣躕躥躪躦軀車軋軌軒軑軔轉軛輪軟轟軲軻轤軸軹軼軤軫轢軺輕軾載輊轎輈輇輅較輒輔輛輦輩輝輥輞輬輟輜輳輻輯轀輸轡轅轄輾轆轍轔辭辯辮邊遼達遷過邁運還這進遠違連遲邇逕跡適選遜遞邐邏遺遙鄧鄺鄔郵鄒鄴鄰鬱郤郟鄶鄭鄆酈鄖鄲醞醱醬釅釃釀釋裏钜鑒鑾鏨釓釔針釘釗釙釕釷釺釧釤鈒釩釣鍆釹鍚釵鈃鈣鈈鈦鈍鈔鍾鈉鋇鋼鈑鈐鑰欽鈞鎢鉤鈧鈁鈥鈄鈕鈀鈺錢鉦鉗鈷缽鈳鉕鈽鈸鉞鑽鉬鉭鉀鈿鈾鐵鉑鈴鑠鉛鉚鈰鉉鉈鉍鈹鐸鉶銬銠鉺銪鋏鋣鐃銍鐺銅鋁銱銦鎧鍘銖銑鋌銩銛鏵銓鉿銚鉻銘錚銫鉸銥鏟銃鐋銨銀銣鑄鐒鋪鋙錸鋱鏈鏗銷鎖鋰鋥鋤鍋鋯鋨鏽銼鋝鋒鋅鋶鐦鐧銳銻鋃鋟鋦錒錆鍺錯錨錡錁錕錩錫錮鑼錘錐錦鍁錈錇錟錠鍵鋸錳錙鍥鍈鍇鏘鍶鍔鍤鍬鍾鍛鎪鍠鍰鎄鍍鎂鏤鎡鏌鎮鎛鎘鑷鐫鎳鎿鎦鎬鎊鎰鎔鏢鏜鏍鏰鏞鏡鏑鏃鏇鏐鐔钁鐐鏷鑥鐓鑭鐠鑹鏹鐙鑊鐳鐶鐲鐮鐿鑔鑣鑞鑲長門閂閃閆閈閉問闖閏闈閑閎間閔閌悶閘鬧閨聞闥閩閭闓閥閣閡閫鬮閱閬闍閾閹閶鬩閿閽閻閼闡闌闃闠闊闋闔闐闒闕闞闤隊陽陰陣階際陸隴陳陘陝隉隕險隨隱隸雋難雛讎靂霧霽黴靄靚靜靨韃鞽韉韝韋韌韍韓韙韞韜韻頁頂頃頇項順須頊頑顧頓頎頒頌頏預顱領頗頸頡頰頲頜潁熲頦頤頻頮頹頷頴穎顆題顒顎顓顏額顳顢顛顙顥纇顫顬顰顴風颺颭颮颯颶颸颼颻飀飄飆飆飛饗饜飣饑飥餳飩餼飪飫飭飯飲餞飾飽飼飿飴餌饒餉餄餎餃餏餅餑餖餓餘餒餕餜餛餡館餷饋餶餿饞饁饃餺餾饈饉饅饊饌饢馬馭馱馴馳驅馹駁驢駔駛駟駙駒騶駐駝駑駕驛駘驍罵駰驕驊駱駭駢驫驪騁驗騂駸駿騏騎騍騅騌驌驂騙騭騤騷騖驁騮騫騸驃騾驄驏驟驥驦驤髏髖髕鬢魘魎魚魛魢魷魨魯魴魺鮁鮃鯰鱸鮋鮓鮒鮊鮑鱟鮍鮐鮭鮚鮳鮪鮞鮦鰂鮜鱠鱭鮫鮮鮺鯗鱘鯁鱺鰱鰹鯉鰣鰷鯀鯊鯇鮶鯽鯒鯖鯪鯕鯫鯡鯤鯧鯝鯢鯰鯛鯨鯵鯴鯔鱝鰈鰏鱨鯷鰮鰃鰓鱷鰍鰒鰉鰁鱂鯿鰠鼇鰭鰨鰥鰩鰟鰜鰳鰾鱈鱉鰻鰵鱅鰼鱖鱔鱗鱒鱯鱤鱧鱣鳥鳩雞鳶鳴鳲鷗鴉鶬鴇鴆鴣鶇鸕鴨鴞鴦鴒鴟鴝鴛鴬鴕鷥鷙鴯鴰鵂鴴鵃鴿鸞鴻鵐鵓鸝鵑鵠鵝鵒鷳鵜鵡鵲鶓鵪鶤鵯鵬鵮鶉鶊鵷鷫鶘鶡鶚鶻鶿鶥鶩鷊鷂鶲鶹鶺鷁鶼鶴鷖鸚鷓鷚鷯鷦鷲鷸鷺鸇鷹鸌鸏鸛鸘鹺麥麩黃黌黶黷黲黽黿鼂鼉鞀鼴齇齊齏齒齔齕齗齟齡齙齠齜齦齬齪齲齷龍龔龕龜誌製谘隻裡係範鬆冇嚐嘗鬨麵準鐘彆閒乾儘臟拚";
const t2s = function(stri) {
    var k = '';
    for (var i = 0; i < stri.length; i++) k += (t.indexOf(stri.charAt(i)) == -1) ? stri.charAt(i) : s.charAt(t.indexOf(stri.charAt(i)))
    return k;
}

const zhouyi = [{
        "c": "0",
        "d": "<h2><b class='g'>坤</b>卦‘第二’坤下坤上</h2><p>坤：元亨，利牝馬之貞。君子有攸往，先迷後得主，利！西南，得朋。東北，喪朋。安貞吉。</p><p class='h2note'>《彖》曰：至哉坤元！萬物資生，乃順承天。坤厚載物，德合无疆，含弘光大，品物咸亨。牝馬地類，行地无疆；柔順利貞，君子攸行。先迷，失道；後順，得常。西南得朋，乃與類行。東北喪朋，乃終有慶。安貞之吉，應地无疆。</p><p class='h2note'><b>《象》</b>曰：地勢坤，君子以厚德載物。</p><p class='a'><b class='heavy'>初六</b>：履霜，堅冰至。<b>《象》</b>曰：「履霜堅冰」，陰始凝也。馴致其道，至堅冰也。</p><p class='a'><b class='heavy'>六二</b>：直方大；不習，无不利。<b>《象》</b>曰：<b class='heavy'>六二</b>之動，直以方也。「不習，无不利」，地道光也。</p><p class='a'><b class='heavy'>六三</b>：含章，可貞。或從王事，无成有終。<b>《象》</b>曰：「含章，可貞」；以時發也。「或從王事」，知光大也。</p><p class='a'><b class='heavy'>六四</b>：括囊，无咎无譽。<b>《象》</b>曰：「括囊，无咎」，慎不害也。</p><p class='a'><b class='heavy'>六五</b>：黃裳，元吉。<b>《象》</b>曰：「黃裳，元吉」，文在中也。</p><p class='a'><b class='heavy'>上六</b>：龍戰于野，其血玄黃。<b>《象》</b>曰：「龍戰于野」，其道窮也。</p><p class='a'>用六：利永貞。<b>《象》</b>曰：用六「永貞」，以大終也。</p><p class='a'><b>《文言》</b>曰：坤，至柔而動也剛，至靜而德方，後得主而有常，含萬物而化光。坤道其順乎！承天而時行。</p><p class='a'>積善之家，必有餘慶；積不善之家，必有餘殃。臣弑其君，子弑其父，非一朝一夕之故，其所由來者漸矣，由辯之不早辯也。<b>《易》</b>曰：「履霜，堅冰至」，蓋言順也。直，其正也。方，其義也。君子敬以直內，義以方外，敬、義立而德不孤。「直，方，大，不習，无不利」，則不疑其所行也。陰雖有美含之，以從王事，弗敢成也。地道也，妻道也，臣道也，地道无成而代有終也。天地變化，草木蕃；天地閉，賢人隱。<b>《易》</b>曰：「括囊；无咎无譽」，蓋言謹也。君子黃中通理，正位居體，美在其中而暢於四支、發於事業，美之至也。陰疑於陽，必戰，為其嫌於无陽也，故稱龍焉；猶未離其類也，故稱血焉。夫玄黃者，天地之雜也，天玄而地黃。</p>"
    },
    {
        "c": "1",
        "d": "<h2><b class='g'>復</b>卦‘第二十四’震下坤上</h2><p>復：亨。出入无疾，朋來无咎。反復其道，七日來復，利有攸往。</p><p class='h2note'>《彖》曰：《復》「亨」，剛反動而以順行，是以出入无疾，朋來无咎。「反復其道，七日來復」，天行也。「利有攸往」，剛長也。《復》其見天地之心乎！</p><p class='h2note'><b>《象》</b>曰：雷在地中，復；先王以至日閉關，商旅不行，后不省方。</p><p class='a'><b class='heavy'>初九</b>：不遠復，无祗悔，元吉。<b>《象》</b>曰：「不遠」之復，以脩身也。</p><p class='a'><b class='heavy'>六二</b>：休復，吉。<b>《象》</b>曰：「休復」之吉，以下仁也。</p><p class='a'><b class='heavy'>六三</b>：頻復，厲，无咎。<b>《象》</b>曰：「頻復」之厲，義无咎也。</p><p class='a'><b class='heavy'>六四</b>：中行獨復。<b>《象》</b>曰：「中行獨復」，以從道也。</p><p class='a'><b class='heavy'>六五</b>：敦復，无悔。<b>《象》</b>曰：「敦復无悔」，中以自考也。</p><p class='a'><b class='heavy'>上六</b>：迷復，凶，有災眚。用行師，終有大敗，以其國君凶，至于十年不克征。<b>《象》</b>曰：「迷復」之凶，反君道也。</p>"
    },
    {
        "c": "2",
        "d": "<h2><b class='g'>師</b>卦‘第七’坎下坤上</h2><p>師：貞，丈人吉，无咎。</p><p class='h2note'>《彖》曰：師，眾也。貞，正也。能以眾正，可以王矣。剛中而應，行險而順，以此毒天下，而民從之，吉，又何咎矣！</p><p class='h2note'><b>《象》</b>曰：地中有水，師；君子以容民畜眾。</p><p class='a'><b class='heavy'>初六</b>：師出以律，否臧，凶。<b>《象》</b>曰：「師出以律」，失律凶也。</p><p class='a'><b class='heavy'>九二</b>：在師中吉，无咎，王三錫命。<b>《象》</b>曰：「在師中吉」，承天寵也。「王三錫命」，懷萬邦也。</p><p class='a'><b class='heavy'>六三</b>：師或輿尸，凶。<b>《象》</b>曰：「師或輿尸」，大无功也。</p><p class='a'><b class='heavy'>六四</b>：師左次，无咎。<b>《象》</b>曰：「左次，无咎」，未失常也。</p><p class='a'><b class='heavy'>六五</b>：田有禽。利執言，无咎。長子帥師，弟子輿尸，貞凶。<b>《象》</b>曰：「長子帥師」，以中行也。「弟子輿尸」，使不當也。</p><p class='a'><b class='heavy'>上六</b>：大君有命，開國承家，小人勿用。<b>《象》</b>曰：「大君有命」，以正功也。「小人勿用」，必亂邦也。</p>"
    },
    {
        "c": "3",
        "d": "<h2><b class='g'>臨</b>卦‘第十九’兌下坤上</h2><p>臨：元亨，利貞。至于八月，有凶。</p><p class='h2note'>《彖》曰：《臨》，剛浸而長，說而順，剛中而應，大亨以正，天之道也。「至于八月，有凶」，消不久也。</p><p class='h2note'><b>《象》</b>曰：澤上有地，臨；君子以教思无窮，容保民无疆。</p><p class='a'><b class='heavy'>初九</b>：咸臨，貞吉。<b>《象》</b>曰：「咸臨，貞吉」，志行正也。</p><p class='a'><b class='heavy'>九二</b>：咸臨，吉，无不利。<b>《象》</b>曰：「咸臨，吉，无不利」，未順命也。</p><p class='a'><b class='heavy'>六三</b>：甘臨，无攸利。既憂之，无咎。<b>《象》</b>曰：「甘臨」，位不當也。「既憂之」，咎不長也。</p><p class='a'><b class='heavy'>六四</b>：至臨，无咎。<b>《象》</b>曰：「至臨，无咎」，位當也。</p><p class='a'><b class='heavy'>六五</b>：知臨，大君之宜，吉。<b>《象》</b>曰：「大君之宜」，行中之謂也。</p><p class='a'><b class='heavy'>上六</b>：敦臨，吉，无咎。<b>《象》</b>曰：「敦臨」之吉，志在內也。</p>"
    },
    {
        "c": "4",
        "d": "<h2><b class='g'>謙</b>卦‘第十五’艮下坤上</h2><p>謙：亨。君子有終。</p><p class='h2note'>《彖》曰：《謙》「亨」，天道下濟而光明，地道卑而上行，天道虧盈而益謙，地道變盈而流謙，鬼神害盈而福謙，人道惡盈而好謙。謙尊而光，卑而不可踰，君子之終也。</p><p class='h2note'><b>《象》</b>曰：地中有山，謙；君子以裒多益寡，稱物平施。</p><p class='a'><b class='heavy'>初六</b>：謙謙君子，用涉大川，吉。<b>《象》</b>曰：「謙謙君子」，卑以自牧也。</p><p class='a'><b class='heavy'>六二</b>：鳴謙，貞吉。<b>《象》</b>曰：「鳴謙，貞吉」，中心得也。</p><p class='a'><b class='heavy'>九三</b>：勞謙君子，有終，吉。<b>《象》</b>曰：「勞謙君子」，萬民服也。</p><p class='a'><b class='heavy'>六四</b>：无不利，撝謙。<b>《象》</b>曰：「无不利，撝謙」；不違則也。</p><p class='a'><b class='heavy'>六五</b>：不富以其鄰，利用侵伐，无不利。<b>《象》</b>曰：「利用侵伐」，征不服也。</p><p class='a'><b class='heavy'>上六</b>：鳴謙，利用行師，征邑國。<b>《象》</b>曰：「鳴謙」，志未得也。可用行師征邑國也。</p>"
    },
    {
        "c": "5",
        "d": "<h2><b class='g'>明夷</b>卦‘第三十六’離下坤上</h2><p>明夷：利艱貞。</p><p class='h2note'>《彖》曰：明入地中，明夷。內文明而外柔順，以蒙大難，文王以之。「利艱貞」，晦其明也。內難而能正其志，箕子以之。</p><p class='h2note'><b>《象》</b>曰：明入地中，明夷；君子以莅眾，用晦而明。</p><p class='a'><b class='heavy'>初九</b>：「明夷于飛，垂其翼。君子于行，三日不食」，有攸往，主人有言。<b>《象》</b>曰：「君子于行」，義不食也。</p><p class='a'><b class='heavy'>六二</b>：明夷夷于左股。用拯馬壯，吉。<b>《象》</b>曰：<b class='heavy'>六二</b>之吉，順以則也。</p><p class='a'><b class='heavy'>九三</b>：明夷于南狩，得其大首。不可疾，貞。<b>《象》</b>曰：「南狩」之志，乃大得也。</p><p class='a'><b class='heavy'>六四</b>：入于左腹，獲明夷之心，於出門庭。<b>《象》</b>曰：「入于左腹」，獲心意也。</p><p class='a'><b class='heavy'>六五</b>：箕子之明夷，利貞。<b>《象》</b>曰：箕子之貞，明不可息也。</p><p class='a'><b class='heavy'>上六</b>：不明晦，初登于天，後入于地。<b>《象》</b>曰：「初登于天」，照四國也。「後入于地」，失則也。</p>"
    },
    {
        "c": "6",
        "d": "<h2><b class='g'>升</b>卦‘第四十六’巽下坤上</h2><p>升：元亨。用見大人，勿恤。南征，吉。</p><p class='h2note'>《彖》曰：柔以時升。巽而順，剛中而應，是以大亨。「用見大人，勿恤」；有慶也。「南征，吉」，志行也。</p><p class='h2note'><b>《象》</b>曰：地中生木，升；君子以順德，積小以高大。</p><p class='a'><b class='heavy'>初六</b>：允升，大吉。<b>《象》</b>曰：「允升，大吉」，上合志也。</p><p class='a'><b class='heavy'>九二</b>：孚乃利用禴，无咎。<b>《象》</b>曰：<b class='heavy'>九二</b>之孚，有喜也。</p><p class='a'><b class='heavy'>九三</b>：升虛邑。<b>《象》</b>曰：「升虛邑」，无所疑也。</p><p class='a'><b class='heavy'>六四</b>：王用亨于岐山，吉，无咎。<b>《象》</b>曰：「王用亨于岐山」，順事也。</p><p class='a'><b class='heavy'>六五</b>：貞吉。升階。<b>《象》</b>曰：「貞吉」「升階」，大得志也。</p><p class='a'><b class='heavy'>上六</b>：冥升，利于不息之貞。<b>《象》</b>曰：冥升在上，消不富也。</p>"
    },
    {
        "c": "7",
        "d": "<h2><b class='g'>泰</b>卦‘第十一’乾下坤上</h2><p>泰：小往大來，吉，亨。</p><p class='h2note'>《彖》曰：《泰》「小往大來，吉，亨」。則是天地交而萬物通也，上下交而其志同也。內陽而外陰，內健而外順，內君子而外小人，君子道長，小人道消也。</p><p class='h2note'><b>《象》</b>曰：天地交，泰；后以財成天地之道，輔相天地之宜，以左右民。</p><p class='a'><b class='heavy'>初九</b>：拔茅茹以其彚，征吉。<b>《象》</b>曰：「拔茅」，「征吉」，志在外也。</p><p class='a'><b class='heavy'>九二</b>：包荒用馮河，不遐遺。朋亡，得尚於中行。<b>《象》</b>曰：「包荒」，「得尚於中行」，以光大也。</p><p class='a'><b class='heavy'>九三</b>：无平不陂，无往不復，艱貞无咎。勿恤，其孚于食，有福。<b>《象》</b>曰：「无往不復」，天地際也。</p><p class='a'><b class='heavy'>六四</b>：翩翩，不富以其鄰，不戒以孚。<b>《象》</b>曰：「翩翩」，「不富」，皆失實也。「不戒以孚」，中心願也。</p><p class='a'><b class='heavy'>六五</b>：帝乙歸妹，以祉。元吉。<b>《象》</b>曰：「以祉」，「元吉」，中以行願也。</p><p class='a'><b class='heavy'>上六</b>：城復于隍，勿用師，自邑告命。貞吝。<b>《象》</b>曰：「城復于隍」，其命亂也。</p>"
    },
    {
        "c": "8",
        "d": "<h2><b class='g'>豫</b>卦‘第十六’坤下震上</h2><p>豫：利建侯、行師。</p><p class='h2note'>《彖》曰：《豫》，剛應而志行，順以動，豫。豫順以動，故天地如之，而況建侯、行師乎？天地以順動，故日月不過而四時不忒。聖人以順動，則刑罰清而民服。《豫》之時義大矣哉！</p><p class='h2note'><b>《象》</b>曰：雷出地奮，豫；先王以作樂崇德，殷薦之上帝以配祖考。</p><p class='a'><b class='heavy'>初六</b>：鳴豫，凶。<b>《象》</b>曰：<b class='heavy'>初六</b>「鳴豫」，志窮凶也。</p><p class='a'><b class='heavy'>六二</b>：介于石，不終日，貞吉。<b>《象》</b>曰：「不終日，貞吉」；以中正也。</p><p class='a'><b class='heavy'>六三</b>：盱豫，悔。遲有悔。<b>《象》</b>曰：盱豫有悔，位不當也。</p><p class='a'><b class='heavy'>九四</b>：由豫，大有得。勿疑，朋盍簪。<b>《象》</b>曰：「由豫，大有得」；志大行也。</p><p class='a'><b class='heavy'>六五</b>：貞疾恒不死。<b>《象》</b>曰：<b class='heavy'>六五</b>「貞疾」，乘剛也。「恒不死」，中未亡也。</p><p class='a'><b class='heavy'>上六</b>：冥豫成，有渝，无咎。<b>《象》</b>曰：冥豫在上，何可長也。</p>"
    },
    {
        "c": "9",
        "d": "<h2><b class='g'>震</b>卦‘第五十一’震下震上</h2><p>震：亨。震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。</p><p class='h2note'>《彖》曰：《震》，亨。「震來虩虩」，恐致福也。「笑言啞啞」，後有則也。「震驚百里」，驚遠而懼邇也。出可以守宗廟社稷，以為祭主也。</p><p class='h2note'><b>《象》</b>曰：洊雷，震；君子以恐懼脩省。</p><p class='a'><b class='heavy'>初九</b>：震來虩虩，後笑言啞啞，吉。<b>《象》</b>曰：「震來虩虩」，恐致福也。「笑言啞啞」，後有則也。</p><p class='a'><b class='heavy'>六二</b>：震來厲，億喪貝，躋于九陵。勿逐，七日得。<b>《象》</b>曰：「震來厲」，乘剛也。</p><p class='a'><b class='heavy'>六三</b>：震蘇蘇。震行无眚。<b>《象》</b>曰：「震蘇蘇」，位不當也。</p><p class='a'><b class='heavy'>九四</b>：震遂泥。<b>《象》</b>曰：「震遂泥」，未光也。</p><p class='a'><b class='heavy'>六五</b>：震往來厲，億无喪有事。<b>《象》</b>曰：「震往來厲」，危行也。其事在中，大无喪也。</p><p class='a'><b class='heavy'>上六</b>：震索索，視矍矍。征，凶。震不于其躬，于其鄰，无咎。婚媾有言。<b>《象》</b>曰：「震索索」，中未得也。雖凶，无咎，畏鄰戒也。</p>"
    },
    {
        "c": "10",
        "d": "<h2><b class='g'>解</b>卦‘第四十’坎下震上</h2><p>解：利西南。无所往，其來復，吉。有攸往，夙吉。</p><p class='h2note'>《彖》曰：《解》，險以動，動而免乎險，解。《解》「利西南」，往得眾也。「其來復，吉」，乃得中也。「有攸往，夙吉」，往有功也。天地解而雷雨作，雷雨作而百果草木皆甲坼，《解》之時大矣哉！</p><p class='h2note'><b>《象》</b>曰：雷雨作，解；君子以赦過宥罪。</p><p class='a'><b class='heavy'>初六</b>：无咎。<b>《象》</b>曰：剛柔之際，義无咎也。</p><p class='a'><b class='heavy'>九二</b>：田獲三狐，得黃矢。貞吉。<b>《象》</b>曰：<b class='heavy'>九二</b>「貞吉」，得中道也。</p><p class='a'><b class='heavy'>六三</b>：負且乘，致寇至。貞吝。<b>《象》</b>曰：「負且乘」，亦可醜也。自我致戎，又誰咎也？</p><p class='a'><b class='heavy'>九四</b>：解而拇，朋至斯孚。<b>《象》</b>曰：「解而拇」，未當位也。</p><p class='a'><b class='heavy'>六五</b>：君子維有解，吉。有孚於小人。<b>《象》</b>曰：君子有解，小人退也。</p><p class='a'><b class='heavy'>上六</b>：公用射隼于高墉之上，獲之。无不利。<b>《象》</b>曰：「公用射隼」，以解悖也。</p>"
    },
    {
        "c": "11",
        "d": "<h2><b class='g'>歸妹</b>卦‘第五十四’兌下震上</h2><p>歸妹：征，凶。无攸利。</p><p class='h2note'>《彖》曰：《歸妹》，天地之大義也。天地不交而萬物不興。《歸妹》，人之終始也。說以動，所歸妹也。「征，凶」，位不當也。「无攸利」，柔乘剛也。</p><p class='h2note'><b>《象》</b>曰：澤上有雷，歸妹；君子以永終知敝。</p><p class='a'><b class='heavy'>初九</b>：歸妹以娣。跛能履。征，吉。<b>《象》</b>曰：「歸妹以娣」，以恒也。「跛能履」，吉相承也。</p><p class='a'><b class='heavy'>九二</b>：眇能視。利幽人之貞。<b>《象》</b>曰：「利幽人之貞」，未變常也。</p><p class='a'><b class='heavy'>六三</b>：歸妹以須，反歸以娣。<b>《象》</b>曰：「歸妹以須」，未當也。</p><p class='a'><b class='heavy'>九四</b>：歸妹愆期，遲歸有時。<b>《象》</b>曰：「愆期」之志，有待而行也。</p><p class='a'><b class='heavy'>六五</b>：帝乙歸妹，其君之袂不如其娣之袂良，月幾望，吉。<b>《象》</b>曰：帝乙歸妹，不如其娣之袂良也。其位在中，以貴行也。</p><p class='a'><b class='heavy'>上六</b>：女承筐无實，士刲羊无血。无攸利。<b>《象》</b>曰：<b class='heavy'>上六</b>「无實」，承虛筐也。</p>"
    },
    {
        "c": "12",
        "d": "<h2><b class='g'>小過</b>卦‘第六十二’艮下震上</h2><p>小過：亨，利貞。可小事，不可大事。飛鳥遺之音，不宜上，宜下。大吉。</p><p class='h2note'>《彖》曰：《小過》，小者過而亨也。過以利貞，與時行也。柔得中，是以小事吉也。剛失位而不中，是以不可大事也。有飛鳥之象焉。「飛鳥遺之音，不宜上，宜下，大吉」，上逆而下順也。</p><p class='h2note'><b>《象》</b>曰：山上有雷，小過；君子以行過乎恭，喪過乎哀，用過乎儉。</p><p class='a'><b class='heavy'>初六</b>：飛鳥以，凶。<b>《象》</b>曰：「飛鳥以，凶」，不可如何也。</p><p class='a'><b class='heavy'>六二</b>：過其祖，遇其妣。不及其君，遇其臣。无咎。<b>《象》</b>曰：「不及其君」，臣不可過也。</p><p class='a'><b class='heavy'>九三</b>：弗過防之，從或戕之。凶。<b>《象》</b>曰：「從或戕之」，凶如何也。</p><p class='a'><b class='heavy'>九四</b>：无咎。弗過遇之，往厲必戒。勿用永貞。<b>《象》</b>曰：「弗過遇之」，位不當也。「往厲必戒」，終不可長也。</p><p class='a'><b class='heavy'>六五</b>：密雲不雨，自我西郊。公弋，取彼在穴。<b>《象》</b>曰：「密雲不雨」，已上也。</p><p class='a'><b class='heavy'>上六</b>：弗遇過之，飛鳥離之。凶。是謂災眚。<b>《象》</b>曰：「弗遇過之」，已亢也。</p>"
    },
    {
        "c": "13",
        "d": "<h2><b class='g'>豐</b>卦‘第五十五’離下震上</h2><p>豐：亨，王假之。勿憂，宜日中。</p><p class='h2note'>《彖》曰：豐，大也。明以動，故豐。「王假之」，尚大也。「勿憂，宜日中」，宜照天下也。日中則昃，月盈則食。天地盈虛，與時消息。而況於人乎？況於鬼神乎？</p><p class='h2note'><b>《象》</b>曰：雷電皆至，豐；君子以折獄致刑。</p><p class='a'><b class='heavy'>初九</b>：遇其配主，雖旬无咎。往，有尚。<b>《象》</b>曰：「雖旬无咎」，過旬災也。</p><p class='a'><b class='heavy'>六二</b>：豐其蔀，日中見斗。往，得疑疾。有孚發若，吉。<b>《象》</b>曰：「有孚發若」，信以發志也。</p><p class='a'><b class='heavy'>九三</b>：豐其沛，日中見沬。折其右肱，无咎。<b>《象》</b>曰：「豐其沛」，不可大事也。「折其右肱」，終不可用也。</p><p class='a'><b class='heavy'>九四</b>：豐其蔀，日中見斗。遇其夷主，吉。<b>《象》</b>曰：「豐其蔀」，位不當也。「日中見斗」，幽不明也。「遇其夷主，吉」，行也。</p><p class='a'><b class='heavy'>六五</b>：來章，有慶譽。吉。<b>《象》</b>曰：<b class='heavy'>六五</b>之吉，有慶也。</p><p class='a'><b class='heavy'>上六</b>：豐其屋，蔀其家。闚其戶，闃其无人，三歲不覿。凶。<b>《象》</b>曰：「豐其屋」，天際翔也。「闚其戶，闃其无人」，自藏也。</p>"
    },
    {
        "c": "14",
        "d": "<h2><b class='g'>恒</b>卦‘第三十二’巽下震上</h2><p>恒：亨，无咎。利貞，利有攸往。</p><p class='h2note'>《彖》曰：恒，久也。剛上而柔下，雷風相與；巽而動，剛柔皆應；恒。《恒》「亨，无咎，利貞」；久於其道也，天地之道恒，久而不已也。「利有攸往」，終則有始也。日月得天而能久照，四時變化而能久成，聖人久於其道而天下化成。觀其所恒而天地萬物之情可見矣！</p><p class='h2note'><b>《象》</b>曰：雷風，恒；君子以立不易方。</p><p class='a'><b class='heavy'>初六</b>：浚恒。貞凶。无攸利。<b>《象》</b>曰：「浚恒」之凶，始求深也。</p><p class='a'><b class='heavy'>九二</b>：悔亡。<b>《象》</b>曰：<b class='heavy'>九二</b>「悔亡」，能久中也。</p><p class='a'><b class='heavy'>九三</b>：不恒其德，或承之羞。貞吝。<b>《象》</b>曰：「不恒其德」，无所容也。</p><p class='a'><b class='heavy'>九四</b>：田无禽。<b>《象》</b>曰：久非其位，安得禽也。</p><p class='a'><b class='heavy'>六五</b>：恒其德。貞，婦人吉，夫子凶。<b>《象》</b>曰：婦人貞吉，從一而終也。夫子制義，從婦凶也。</p><p class='a'><b class='heavy'>上六</b>：振恒，凶。<b>《象》</b>曰：振恒在上，大无功也。</p>"
    },
    {
        "c": "15",
        "d": "<h2><b class='g'>大壯</b>卦‘第三十四’乾下震上</h2><p>大壯：利貞。</p><p class='h2note'>《彖》曰：「大壯」，大者壯也。剛以動，故壯。「大壯，利貞」，大者正也，正大而天地之情可見矣。</p><p class='h2note'><b>《象》</b>曰：雷在天上，大壯；君子以非禮弗履。</p><p class='a'><b class='heavy'>初九</b>：壯于趾，征，凶。有孚。<b>《象》</b>曰：「壯于趾」，其孚窮也。</p><p class='a'><b class='heavy'>九二</b>：貞吉。<b>《象》</b>曰：<b class='heavy'>九二</b>「貞吉」，以中也。</p><p class='a'><b class='heavy'>九三</b>：小人用，壯。君子用，罔。貞厲。羝羊觸藩，羸其角。<b>《象》</b>曰：小人用壯，君子罔也。</p><p class='a'><b class='heavy'>九四</b>：貞吉，悔亡。藩決不羸，壯於大輿之輹。<b>《象》</b>曰：「藩決不羸」，尚往也。</p><p class='a'><b class='heavy'>六五</b>：喪羊于易，无悔。<b>《象》</b>曰：「喪羊于易」，位不當也。</p><p class='a'><b class='heavy'>上六</b>：羝羊觸藩，不能退，不能遂。无攸利。艱則吉。<b>《象》</b>曰：「不能退，不能遂」，不詳也。「艱則吉」，咎不長也。</p>"
    },
    {
        "c": "16",
        "d": "<h2><b class='g'>比</b>卦‘第八’坤下坎上</h2><p>比：吉。原筮，元永貞，无咎。不甯方來，後夫凶。</p><p class='h2note'>《彖》曰：《比》，吉也。比，輔也，下順從也。「原筮，元永貞，无咎」，以剛中也。「不甯方來」，上下應也。「後夫凶」，其道窮也。</p><p class='h2note'><b>《象》</b>曰：地上有水，比；先王以建萬國親諸侯。</p><p class='a'><b class='heavy'>初六</b>：有孚，比之，无咎。有孚，盈缶，終來有它，吉。<b>《象》</b>曰：《比》之<b class='heavy'>初六</b>，有它吉也。</p><p class='a'><b class='heavy'>六二</b>：比之自內，貞吉。<b>《象》</b>曰：「比之自內」，不自失也。</p><p class='a'><b class='heavy'>六三</b>：比之匪人。<b>《象》</b>曰：「比之匪人」，不亦傷乎！</p><p class='a'><b class='heavy'>六四</b>：外比之，貞吉。<b>《象》</b>曰：外比於賢，以從上也。</p><p class='a'><b class='heavy'>九五</b>：顯比，王用三驅，失前禽。邑人不誡，吉。<b>《象》</b>曰：「顯比」之吉，位正中也。舍逆取順，失前禽也。「邑人不誡」，上使中也。</p><p class='a'><b class='heavy'>上六</b>：比之无首，凶。<b>《象》</b>曰：「比之无首」，无所終也。</p>"
    },
    {
        "c": "17",
        "d": "<h2><b class='g'>屯</b>卦‘第三’震下坎上</h2><p>屯：元亨，利貞，勿用有攸往。利建侯。</p><p class='h2note'>《彖》曰：《屯》，剛柔始交而難生，動乎險中，大亨貞。雷雨之動滿盈，天造草昧，宜建侯而不寧。</p><p class='h2note'><b>《象》</b>曰：雲雷，屯；君子以經綸。</p><p class='a'><b class='heavy'>初九</b>：磐桓，利居貞，利建侯。<b>《象》</b>曰：雖磐桓，志行正也。以貴下賤，大得民也。</p><p class='a'><b class='heavy'>六二</b>：屯如邅如，乘馬班如。匪寇，婚媾，女子貞，不字，十年乃字。<b>《象》</b>曰：<b class='heavy'>六二</b>之難，乘剛也。「十年乃字」，反常也。</p><p class='a'><b class='heavy'>六三</b>：即鹿无虞，惟入于林中，君子幾不如舍，往，吝。<b>《象》</b>曰：「即鹿无虞」，以從禽也。君子舍之，往吝窮也。</p><p class='a'><b class='heavy'>六四</b>：乘馬班如，求婚媾。往吉，无不利。<b>《象》</b>曰：求而往，明也。</p><p class='a'><b class='heavy'>九五</b>：屯其膏，小貞吉，大貞凶。<b>《象》</b>曰：「屯其膏」，施未光也。</p><p class='a'><b class='heavy'>上六</b>：乘馬班如，泣血漣如。<b>《象》</b>曰：「泣血漣如」，何可長也？</p>"
    },
    {
        "c": "18",
        "d": "<h2><b class='g'>坎</b>卦‘第二十九’坎下坎上</h2><p>習坎：有孚，維心亨，行有尚。</p><p class='h2note'>《彖》曰：習坎，重險也。水流而不盈，行險而不失其信。「維心亨」，乃以剛中也。「行有尚」，往有功也。天險不可升也，地險山川丘陵也。王公設險以守其國，《險》之時用大矣哉！</p><p class='h2note'><b>《象》</b>曰：水洊至，習坎；君子以常德行，習教事。</p><p class='a'><b class='heavy'>初六</b>：習坎，入於坎窞，凶。<b>《象》</b>曰：習坎入坎，失道凶也。</p><p class='a'><b class='heavy'>九二</b>：坎有險，求小得。<b>《象》</b>曰：「求小得」，未出中也。</p><p class='a'><b class='heavy'>六三</b>：來之坎坎，險且枕，入於坎窞，勿用。<b>《象》</b>曰：「來之坎坎」，終无功也。</p><p class='a'><b class='heavy'>六四</b>：樽酒，簋貳，用缶。納約自牖，終无咎。<b>《象》</b>曰：「樽酒，簋貳」，剛柔際也。</p><p class='a'><b class='heavy'>九五</b>：坎不盈，祗既平，无咎。<b>《象》</b>曰：坎不盈，中未大也。</p><p class='a'><b class='heavy'>上六</b>：係用徽纆，寘於叢棘，三歲不得，凶。<b>《象》</b>曰：<b class='heavy'>上六</b>失道，凶三歲也。</p>"
    },
    {
        "c": "19",
        "d": "<h2><b class='g'>節</b>卦‘第六十’兌下坎上</h2><p>節：亨。苦節，不可貞。</p><p class='h2note'>《彖》曰：《節》「亨」，剛柔分而剛得中。「苦節，不可貞」，其道窮也。說以行險，當位以節，中正以通。天地節而四時成，節以制度，不傷財，不害民。</p><p class='h2note'><b>《象》</b>曰：澤上有水，節；君子以制數度，議德行。</p><p class='a'><b class='heavy'>初九</b>：不出戶庭，无咎。<b>《象》</b>曰：「不出戶庭」，知通塞也。</p><p class='a'><b class='heavy'>九二</b>：不出門庭，凶。<b>《象》</b>曰：「不出門庭」，失時極也。</p><p class='a'><b class='heavy'>六三</b>：不節若，則嗟若。无咎。<b>《象》</b>曰：「不節」之嗟，又誰咎也？</p><p class='a'><b class='heavy'>六四</b>：安節，亨。<b>《象》</b>曰：「安節」之亨，承上道也。</p><p class='a'><b class='heavy'>九五</b>：甘節，吉。往，有尚。<b>《象》</b>曰：「甘節」之吉，居位中也。</p><p class='a'><b class='heavy'>上六</b>：苦節，貞凶，悔亡。<b>《象》</b>曰：「苦節，貞凶」，其道窮也。</p>"
    },
    {
        "c": "20",
        "d": "<h2><b class='g'>蹇</b>卦‘第三十九’艮下坎上</h2><p>蹇：利西南，不利東北。利見大人。貞吉。</p><p class='h2note'>《彖》曰：《蹇》，難也，險在前也，見險而能止，知矣哉！《蹇》「利西南」，往得中也。「不利東北」，其道窮也。「利見大人」，往有功也。當位「貞吉」，以正邦也。《蹇》之時用大矣哉！</p><p class='h2note'><b>《象》</b>曰：山上有水，蹇；君子以反身脩德。</p><p class='a'><b class='heavy'>初六</b>：往蹇來譽。<b>《象》</b>曰：「往蹇來譽」，宜待也。</p><p class='a'><b class='heavy'>六二</b>：王臣蹇蹇，匪躬之故。<b>《象》</b>曰：「王臣蹇蹇」，終无尤也。</p><p class='a'><b class='heavy'>九三</b>：往蹇來反。<b>《象》</b>曰：「往蹇來反」，內喜之也。</p><p class='a'><b class='heavy'>六四</b>：往蹇來連。<b>《象》</b>曰：「往蹇來連」，當位實也。</p><p class='a'><b class='heavy'>九五</b>：大蹇朋來。<b>《象》</b>曰：「大蹇朋來」，以中節也。</p><p class='a'><b class='heavy'>上六</b>：往蹇來碩，吉。利見大人。<b>《象》</b>曰：「往蹇來碩」，志在內也。「利見大人」，以從貴也。</p>"
    },
    {
        "c": "21",
        "d": "<h2><b class='g'>既濟</b>卦‘第六十三’離下坎上</h2><p>既濟：亨，小利貞。初吉，終亂。</p><p class='h2note'>《彖》曰：《既濟》「亨」，小者亨也。「利貞」，剛柔正而位當也。「初吉」，柔得中也。終止則亂，其道窮也。</p><p class='h2note'><b>《象》</b>曰：水在火上，既濟；君子以思患而豫防之。</p><p class='a'><b class='heavy'>初九</b>：曳其輪，濡其尾。无咎。<b>《象》</b>曰：「曳其輪」，義无咎也。</p><p class='a'><b class='heavy'>六二</b>：婦喪其茀，勿逐，七日得。<b>《象》</b>曰：「七日得」，以中道也。</p><p class='a'><b class='heavy'>九三</b>：高宗伐鬼方，三年克之。小人勿用。<b>《象》</b>曰：「三年克之」，憊也。</p><p class='a'><b class='heavy'>六四</b>：繻有衣袽，終日戒。<b>《象》</b>曰：「終日戒」，有所疑也。</p><p class='a'><b class='heavy'>九五</b>：東鄰殺牛，不如西鄰之禴祭，實受其福。<b>《象》</b>曰：東鄰殺牛，不如西鄰之時也。「實受其福」，吉大來也。</p><p class='a'><b class='heavy'>上六</b>：濡其首，厲。<b>《象》</b>曰：「濡其首，厲」，何可久也。</p>"
    },
    {
        "c": "22",
        "d": "<h2><b class='g'>井</b>卦‘第四十八’巽下坎上</h2><p>井：改邑不改井，无喪无得，往來井井。汔至，亦未繘井，羸其瓶，凶。</p><p class='h2note'>《彖》曰：巽乎水而上水，井。井，養而不窮也。「改邑不改井」，乃以剛中也。「汔至亦未繘井」，未有功也。「羸其瓶」，是以凶也。</p><p class='h2note'><b>《象》</b>曰：木上有水，井；君子以勞民勸相。</p><p class='a'><b class='heavy'>初六</b>：井泥不食。舊井无禽。<b>《象》</b>曰：「井泥不食」，下也。「舊井无禽」，時舍也。</p><p class='a'><b class='heavy'>九二</b>：井穀射鮒，甕敝漏。<b>《象》</b>曰：「井穀射鮒」，无與也。</p><p class='a'><b class='heavy'>九三</b>：井渫不食，為我心惻，可用汲。王明，竝受其福。<b>《象》</b>曰：「井渫不食」，行惻也。求王明，受福也。</p><p class='a'><b class='heavy'>六四</b>：井甃，无咎。<b>《象》</b>曰：「井甃，无咎」，修井也。</p><p class='a'><b class='heavy'>九五</b>：井冽，寒泉，食。<b>《象》</b>曰：「寒泉」之食，中正也。</p><p class='a'><b class='heavy'>上六</b>：井收勿幕，有孚，元吉。<b>《象》</b>曰：元吉在上，大成也。</p>"
    },
    {
        "c": "23",
        "d": "<h2><b class='g'>需</b>卦‘第五’乾下坎上</h2><p>需：有孚，光亨，貞吉。利涉大川。</p><p class='h2note'>《彖》曰：《需》，須也，險在前也。剛健而不陷，其義不困窮矣。「需，有孚，光亨，貞吉」，位乎天位，以正中也。「利涉大川」，往有功也。</p><p class='h2note'><b>《象》</b>曰：雲上於天，需；君子以飲食宴樂。</p><p class='a'><b class='heavy'>初九</b>：需于郊，利用恒，无咎。<b>《象》</b>曰：「需於郊」，不犯難行也。「利用恒，无咎」，未失常也。</p><p class='a'><b class='heavy'>九二</b>：需于沙，小有言，終吉。<b>《象》</b>曰：「需于沙」，衍在中也。雖小有言，以吉終也。</p><p class='a'><b class='heavy'>九三</b>：需於泥，致寇至。<b>《象》</b>曰：「需於泥」，災在外也。自我致寇，敬慎不敗也。</p><p class='a'><b class='heavy'>六四</b>：需于血，出自穴。<b>《象》</b>曰：「需于血」，順以聽也。</p><p class='a'><b class='heavy'>九五</b>：需于酒食，貞吉。<b>《象》</b>曰：「酒食，貞吉」，以中正也。</p><p class='a'><b class='heavy'>上六</b>：入于穴，有不速之客三人來，敬之，終吉。<b>《象》</b>曰：「不速之客來，敬之，終吉」，雖不當位，未大失也。</p>"
    },
    {
        "c": "24",
        "d": "<h2><b class='g'>萃</b>卦‘第四十五’坤下兌上</h2><p>萃：亨，王假有廟。利見大人。亨，利貞。用大牲，吉。利有攸往。</p><p class='h2note'>《彖》曰：《萃》，聚也；順以說，剛中而應，故聚也。「王假有廟」，致孝享也。「利見大人，亨」，聚以正也。「用大牲，吉，利有攸往」，順天命也。觀其所聚而天地萬物之情可見矣。</p><p class='h2note'><b>《象》</b>曰：澤上於地，萃；君子以除戎器，戒不虞。</p><p class='a'><b class='heavy'>初六</b>：有孚不終，乃亂乃萃，若號。一握為笑，勿恤。往，无咎。<b>《象》</b>曰：「乃亂乃萃」，其志亂也。</p><p class='a'><b class='heavy'>六二</b>：引吉，无咎。孚乃利用禴。<b>《象》</b>曰：「引吉，无咎」，中未變也。</p><p class='a'><b class='heavy'>六三</b>：萃如嗟如，无攸利。往，无咎，小吝。<b>《象》</b>曰：「往，无咎」，上巽也。</p><p class='a'><b class='heavy'>九四</b>：大吉，无咎。<b>《象》</b>曰：「大吉，无咎」，位不當也。</p><p class='a'><b class='heavy'>九五</b>：萃有位，无咎。匪孚，元永貞。悔亡。<b>《象》</b>曰：「萃有位」，志未光也。</p><p class='a'><b class='heavy'>上六</b>：齎咨涕洟，无咎。<b>《象》</b>曰：「齎咨涕洟」，未安上也。</p>"
    },
    {
        "c": "25",
        "d": "<h2><b class='g'>隨</b>卦‘第十七’震下兌上</h2><p>隨：元亨，利貞。无咎。</p><p class='h2note'>《彖》曰：《隨》，剛來而下柔，動而說，隨。大亨，貞，无咎，而天下隨時，隨之時義大矣哉！</p><p class='h2note'><b>《象》</b>曰：澤中有雷，隨；君子以嚮晦入宴息。</p><p class='a'><b class='heavy'>初九</b>：官有渝，貞吉。出門交有功。<b>《象》</b>曰：「官有渝」，從正吉也。「出門交有功」，不失也。</p><p class='a'><b class='heavy'>六二</b>：係小子，失丈夫。<b>《象》</b>曰：「係小子」，弗兼與也。</p><p class='a'><b class='heavy'>六三</b>：係丈夫，失小子。隨有求，得。利居貞。<b>《象》</b>曰：「係丈夫」，志舍下也。</p><p class='a'><b class='heavy'>九四</b>：隨有獲，貞凶。有孚在道，以明，何咎？<b>《象》</b>曰：「隨有獲」，其義凶也。「有孚在道」，明功也。</p><p class='a'><b class='heavy'>九五</b>：孚于嘉，吉。<b>《象》</b>曰：「孚于嘉，吉」，位正中也。</p><p class='a'><b class='heavy'>上六</b>：拘係之，乃從維之。王用亨于西山。<b>《象》</b>曰：「拘係之」，上窮也。</p>"
    },
    {
        "c": "26",
        "d": "<h2><b class='g'>困</b>卦‘第四十七’坎下兌上</h2><p>困：亨。貞，大人吉。无咎。有言不信。</p><p class='h2note'>《彖》曰：《困》，剛揜也。險以說，困而不失其所亨，其唯君子乎！「貞，大人吉」，以剛中也。「有言不信」，尚口乃窮也。</p><p class='h2note'><b>《象》</b>曰：澤无水，困；君子以致命遂志。</p><p class='a'><b class='heavy'>初六</b>：臀困于株木，入于幽谷，三歲不覿。<b>《象》</b>曰：「入于幽谷」，幽不明也。</p><p class='a'><b class='heavy'>九二</b>：困于酒食，朱紱方來。利用享祀。征，凶。无咎。<b>《象》</b>曰：「困於酒食」，中有慶也。</p><p class='a'><b class='heavy'>六三</b>：困于石，據于蒺藜。入于其宮，不見其妻。凶。<b>《象》</b>曰：「據于蒺藜」，乘剛也。「入于其宮，不見其妻」，不祥也。</p><p class='a'><b class='heavy'>九四</b>：來徐徐，困于金車。吝，有終。<b>《象》</b>曰：「來徐徐」，志在下也。雖不當位，有與也。</p><p class='a'><b class='heavy'>九五</b>：劓刖，困於赤紱，乃徐有說。利用祭祀。<b>《象》</b>曰：劓刖，志未得也。「乃徐有說」，以中直也。「利用祭祀」，受福也。</p><p class='a'><b class='heavy'>上六</b>：困于葛藟，于臲卼，曰動，悔，有悔。征，吉。<b>《象》</b>曰：「困于葛藟」，未當也。「動，悔，有悔」，吉行也。</p>"
    },
    {
        "c": "27",
        "d": "<h2><b class='g'>兌</b>卦‘第五十八’兌下兌上</h2><p>兌：亨，利貞。</p><p class='h2note'>《彖》曰：《兌》，說也。剛中而柔外。說以利貞，是以順乎天而應乎人。說以先民，民忘其勞。說以犯難，民忘其死。《說》之大，民勸矣哉！</p><p class='h2note'><b>《象》</b>曰：麗澤，兌；君子以朋友講習。</p><p class='a'><b class='heavy'>初九</b>：和兌。吉。<b>《象》</b>曰：「和兌」之吉，行未疑也。</p><p class='a'><b class='heavy'>九二</b>：孚兌。吉。悔亡。<b>《象》</b>曰：「孚兌」之吉，信志也。</p><p class='a'><b class='heavy'>六三</b>：來兌。凶。<b>《象》</b>曰：「來兌」之凶，位不當也。</p><p class='a'><b class='heavy'>九四</b>：商兌未寧，介疾有喜。<b>《象》</b>曰：<b class='heavy'>九四</b>之喜，有慶也。</p><p class='a'><b class='heavy'>九五</b>：孚于剝，有厲。<b>《象》</b>曰：「孚于剝」，位正當也。</p><p class='a'><b class='heavy'>上六</b>：引兌。<b>《象》</b>曰：<b class='heavy'>上六</b>「引兌」，未光也。</p>"
    },
    {
        "c": "28",
        "d": "<h2><b class='g'>咸</b>卦‘第三十一’艮下兌上</h2><p>咸：亨，利貞。取女，吉。</p><p class='h2note'>《彖》曰：《咸》，感也。柔上而剛下，二氣感應以相與，止而說，男下女，是以「亨，利貞」，「取女，吉」也。天地感而萬物化生，聖人感人心而天下和平。觀其所感而天地萬物之情可見矣！</p><p class='h2note'><b>《象》</b>曰：山上有澤，咸；君子以虛受人。</p><p class='a'><b class='heavy'>初六</b>：咸其拇。<b>《象》</b>曰：「咸其拇」，志在外也。</p><p class='a'><b class='heavy'>六二</b>：咸其腓，凶。居，吉。<b>《象》</b>曰：雖凶居吉，順不害也。</p><p class='a'><b class='heavy'>九三</b>：咸其股，執其隨。往，吝。<b>《象》</b>曰：「咸其股」，亦不處也。志在隨人，所執下也。</p><p class='a'><b class='heavy'>九四</b>：貞吉。悔亡。憧憧往來，朋從爾思。<b>《象》</b>曰：「貞吉，悔亡」，未感害也。「憧憧往來」，未光大也。</p><p class='a'><b class='heavy'>九五</b>：咸其脢，无悔。<b>《象》</b>曰：「咸其脢」，志末也。</p><p class='a'><b class='heavy'>上六</b>：咸其輔頰、舌。<b>《象》</b>曰：「咸其輔頰、舌」，滕口說也。</p>"
    },
    {
        "c": "29",
        "d": "<h2><b class='g'>革</b>卦‘第四十九’離下兌上</h2><p>革：巳日乃孚。元亨，利貞。悔亡。</p><p class='h2note'>《彖》曰：《革》，水火相息，二女同居，其志不相得，曰「革」。「巳日乃孚」，革而信之。文明以說，大亨以正。革而當，其悔乃亡。天地革而四時成。湯武革命，順乎天而應乎人，《革》之時大矣哉！</p><p class='h2note'><b>《象》</b>曰：澤中有火，革；君子以治曆明時。</p><p class='a'><b class='heavy'>初九</b>：鞏用黃牛之革。<b>《象》</b>曰：「鞏用黃牛」，不可以有為也。</p><p class='a'><b class='heavy'>六二</b>：巳日乃革之。征，吉。无咎。<b>《象》</b>曰：「巳日革之」，行有嘉也。</p><p class='a'><b class='heavy'>九三</b>：征，凶。貞厲。革言三就，有孚。<b>《象》</b>曰：「革言三就」，又何之矣？</p><p class='a'><b class='heavy'>九四</b>：悔亡。有孚，改命，吉。<b>《象》</b>曰：「改命」之吉，信志也。</p><p class='a'><b class='heavy'>九五</b>：大人虎變。未占，有孚。<b>《象》</b>曰：「大人虎變」，其文炳也。</p><p class='a'><b class='heavy'>上六</b>：君子豹變，小人革面。征，凶。居，貞吉。<b>《象》</b>曰：「君子豹變」，其文蔚也。「小人革面」，順以從君也。</p>"
    },
    {
        "c": "30",
        "d": "<h2><b class='g'>大過</b>卦‘第二十八’巽下兌上</h2><p>大過：棟橈，利有攸往，亨。</p><p class='h2note'>《彖》曰：《大過》，大者過也。棟橈，本末弱也。剛過而中，巽而說行。「利有攸往」，乃亨。《大過》之時大矣哉！</p><p class='h2note'><b>《象》</b>曰：澤滅木，大過，君子以獨立不懼，遯世无悶。</p><p class='a'><b class='heavy'>初六</b>：藉用白茅，无咎。<b>《象》</b>曰：「藉用白茅」，柔在下也。</p><p class='a'><b class='heavy'>九二</b>：枯楊生稊，老夫得其女妻，无不利。<b>《象》</b>曰：老夫女妻，過以相與也。</p><p class='a'><b class='heavy'>九三</b>：棟橈，凶。<b>《象》</b>曰：棟橈之凶，不可以有輔也。</p><p class='a'><b class='heavy'>九四</b>：棟隆，吉，有它吝。<b>《象》</b>曰：棟隆之吉，不橈乎下也。</p><p class='a'><b class='heavy'>九五</b>：枯楊生華，老婦得士夫，无咎无譽。<b>《象》</b>曰：枯楊生華，何可久也？老婦士夫，亦可醜也。</p><p class='a'><b class='heavy'>上六</b>：過涉滅頂，凶，无咎。<b>《象》</b>曰：過涉之凶，不可咎也。</p>"
    },
    {
        "c": "31",
        "d": "<h2><b class='g'>夬</b>卦‘第四十三’乾下兌上</h2><p>夬：揚于王庭，孚號。有厲，告自邑。不利即戎。利有攸往。</p><p class='h2note'>《彖》曰：《夬》，決也，剛決柔也。健而說，決而和。「揚于王庭」，柔乘五剛也。「孚號有厲」，其危乃光也。「告自邑」，「不利即戎」，所尚乃窮也。「利有攸往」，剛長乃終也。</p><p class='h2note'><b>《象》</b>曰：澤上於天，夬；君子以施祿及下，居德則忌。</p><p class='a'><b class='heavy'>初九</b>：壯于前趾。往，不勝為吝。<b>《象》</b>曰：不勝而往，咎也。</p><p class='a'><b class='heavy'>九二</b>：惕號，莫夜有戎，勿恤。<b>《象》</b>曰：「有戎，勿恤」，得中道也。</p><p class='a'><b class='heavy'>九三</b>：壯于頄，有凶。君子夬夬獨行，遇雨若濡。有慍，无咎。<b>《象》</b>曰：「君子夬夬」，終无咎也。</p><p class='a'><b class='heavy'>九四</b>：臀无膚，其行次且。牽羊，悔亡。聞言不信。<b>《象》</b>曰：「其行次且」，位不當也。「聞言不信」，聰不明也。</p><p class='a'><b class='heavy'>九五</b>：莧陸夬夬中行，无咎。<b>《象》</b>曰：「中行无咎」，中未光也。</p><p class='a'><b class='heavy'>上六</b>：无號，終有凶。<b>《象》</b>曰：「无號」之凶，終不可長也。</p>"
    },
    {
        "c": "32",
        "d": "<h2><b class='g'>剝</b>卦‘第二十三’坤下艮上</h2><p>剝：不利有攸往。</p><p class='h2note'>《彖》曰：《剝》，剝也，柔變剛也。「不利有攸往」，小人長也。順而止之，觀象也。君子尚消息盈虛，天行也。</p><p class='h2note'><b>《象》</b>曰：山附地上，剝；上以厚下安宅。</p><p class='a'><b class='heavy'>初六</b>：剝牀以足。蔑貞，凶。<b>《象》</b>曰：「剝牀以足」，以滅下也。</p><p class='a'><b class='heavy'>六二</b>：剝牀以辨，蔑貞，凶。<b>《象》</b>曰：「剝牀以辨」，未有與也。</p><p class='a'><b class='heavy'>六三</b>：剝之，无咎。<b>《象》</b>曰：「剝之，无咎」，失上下也。</p><p class='a'><b class='heavy'>六四</b>：剝牀以膚，凶。<b>《象》</b>曰：「剝牀以膚」，切近災也。</p><p class='a'><b class='heavy'>六五</b>：貫魚，以宮人寵，无不利。<b>《象》</b>曰：「以宮人寵」，終无尤也。</p><p class='a'><b class='heavy'>上九</b>：碩果不食，君子得輿，小人剝廬。<b>《象》</b>曰：「君子得輿」，民所載也。「小人剝廬」，終不可用也。</p>"
    },
    {
        "c": "33",
        "d": "<h2><b class='g'>頤</b>卦‘第二十七’震下艮上</h2><p>頤：貞吉。觀頤，自求口實。</p><p class='h2note'>《彖》曰：《頤》「貞吉」，養正則吉也。「觀頤」，觀其所養也。「自求口實」，觀其自養也。天地養萬物，聖人養賢以及萬民，《頤》之時義大矣哉！</p><p class='h2note'><b>《象》</b>曰：山下有雷，頤；君子以慎言語，節飲食。</p><p class='a'><b class='heavy'>初九</b>：舍爾靈龜，觀我朶頤，凶。<b>《象》</b>曰：「觀我朶頤」，亦不足貴也。</p><p class='a'><b class='heavy'>六二</b>：顛頤，拂經于丘頤。征，凶。<b>《象》</b>曰：<b class='heavy'>六二</b>「征，凶」，行失類也。</p><p class='a'><b class='heavy'>六三</b>：拂頤，貞凶。十年勿用，无攸利。<b>《象》</b>曰：「十年勿用」，道大悖也。</p><p class='a'><b class='heavy'>六四</b>：顛頤，吉。虎視眈眈，其欲逐逐，无咎。<b>《象》</b>曰：「顛頤」之吉，上施光也。</p><p class='a'><b class='heavy'>六五</b>：拂經，居貞吉。不可涉大川。<b>《象》</b>曰：「居貞」之吉，順以從上也。</p><p class='a'><b class='heavy'>上九</b>：由頤，厲，吉。利涉大川。<b>《象》</b>曰：「由頤，厲，吉」，大有慶也。</p>"
    },
    {
        "c": "34",
        "d": "<h2><b class='g'>蒙</b>卦‘第四’坎下艮上</h2><p>蒙：亨。匪我求童蒙，童蒙求我。初噬，告；再三，瀆，瀆則不告。利貞。</p><p class='quote'>《彖》曰：《蒙》，山下有險，險而止，蒙。「蒙亨」，以亨行時中也。「匪我求童蒙，童蒙求我」，志應也。「初噬，告」，以剛中也。「再三，瀆，瀆則不告」，瀆蒙也；蒙以養正，聖功也。</p><p class='h2note'><b>《象》</b>曰：山下出泉，蒙。君子以果行育德。</p><p class='a'><b class='heavy'>初六</b>：發蒙，利用刑人。用說桎梏以往，吝。<b>《象》</b>曰：「利用刑人」，以正法也。</p><p class='a'><b class='heavy'>九二</b>：包蒙，吉。納婦，吉。子克家。<b>《象》</b>曰：「子克家」，剛柔接也。</p><p class='a'><b class='heavy'>六三</b>：勿用取女，見金夫，不有躬，无攸利。<b>《象》</b>曰：「勿用取女」，行不順也。</p><p class='a'><b class='heavy'>六四</b>：困蒙，吝。<b>《象》</b>曰：困蒙之吝，獨遠實也。</p><p class='a'><b class='heavy'>六五</b>：童蒙，吉。<b>《象》</b>曰：童蒙之吉，順以巽也。</p><p class='a'><b class='heavy'>上九</b>：擊蒙，不利為寇，利禦寇。<b>《象》</b>曰：利用禦寇，上下順也。</p>"
    },
    {
        "c": "35",
        "d": "<h2><b class='g'>損</b>卦‘第四十一’兌下艮上</h2><p>損：有孚，元吉，无咎，可貞。利有攸往。曷之用？二簋可用享。</p><p class='h2note'>《彖》曰：《損》，損下益上，其道上行。損而「有孚，元吉，无咎，可貞」。「利有攸往」，「曷之用，二簋可用享」。二簋應有時，損剛益柔有時。損益盈虛，與時偕行。</p><p class='h2note'><b>《象》</b>曰：山下有澤，損；君子以懲忿窒欲。</p><p class='a'><b class='heavy'>初九</b>：巳事遄往，无咎。酌損之。<b>《象》</b>曰：「巳事遄往」，尚合志也。</p><p class='a'><b class='heavy'>九二</b>：利貞。征，凶。弗損，益之。<b>《象》</b>曰：<b class='heavy'>九二</b>「利貞」，中以為志也。</p><p class='a'><b class='heavy'>六三</b>：三人行則損一人，一人行則得其友。<b>《象》</b>曰：一人行，三則疑也。</p><p class='a'><b class='heavy'>六四</b>：損其疾，使遄有喜，无咎。<b>《象》</b>曰：「損其疾」，亦可喜也。</p><p class='a'><b class='heavy'>六五</b>：或益之十朋之龜，弗克違，元吉。<b>《象》</b>曰：<b class='heavy'>六五</b>「元吉」，自上祐也。</p><p class='a'><b class='heavy'>上九</b>：弗損，益之，无咎，貞吉。利有攸往，得臣无家。<b>《象》</b>曰：「弗損，益之」，大得志也。</p>"
    },
    {
        "c": "36",
        "d": "<h2><b class='g'>艮</b>卦‘第五十二’艮下艮上</h2><p>艮：艮其背，不獲其身。行其庭，不見其人。无咎。</p><p class='h2note'>《彖》曰：《艮》，止也。時止則止，時行則行。動靜不失其時，其道光明。艮其止，止其所也。上下敵應，不相與也。是以不獲其身，行其庭不見其人，无咎也。</p><p class='h2note'><b>《象》</b>曰：兼山，艮；君子以思不出其位。</p><p class='a'><b class='heavy'>初六</b>：艮其趾，无咎。利永貞。<b>《象》</b>曰：「艮其趾」，未失正也。</p><p class='a'><b class='heavy'>六二</b>：艮其腓，不拯其隨，其心不快。<b>《象》</b>曰：「不拯其隨」，未退聽也。</p><p class='a'><b class='heavy'>九三</b>：艮其限，列其夤，厲薰心。<b>《象》</b>曰：「艮其限」，危薰心也。</p><p class='a'><b class='heavy'>六四</b>：艮其身，无咎。<b>《象》</b>曰：「艮其身」，止諸躬也。</p><p class='a'><b class='heavy'>六五</b>：艮其輔，言有序。悔亡。<b>《象》</b>曰：「艮其輔」，以中正也。</p><p class='a'><b class='heavy'>上九</b>：敦艮，吉。<b>《象》</b>曰：「敦艮」之吉，以厚終也。</p>"
    },
    {
        "c": "37",
        "d": "<h2><b class='g'>賁</b>卦‘第二十二’離下艮上</h2><p>賁：亨，小利有攸往。</p><p class='h2note'>《彖》曰：《賁》亨，柔來而文剛，故亨；分剛上而文柔，故小利有攸往，天文也。文明以止，人文也。觀乎天文以察時變，觀乎人文以化成天下。</p><p class='h2note'><b>《象》</b>曰：山下有火，賁；君子以明庶政，无敢折獄。</p><p class='a'><b class='heavy'>初九</b>：賁其趾，舍車而徒。<b>《象》</b>曰：「舍車而徒」，義弗乘也。</p><p class='a'><b class='heavy'>六二</b>：賁其須。<b>《象》</b>曰：「賁其須」，與上興也。</p><p class='a'><b class='heavy'>九三</b>：賁如濡如，永貞，吉。<b>《象》</b>曰：「永貞」之吉，終莫之陵也。</p><p class='a'><b class='heavy'>六四</b>：賁如皤如，白馬翰如，匪寇，婚媾。<b>《象》</b>曰：<b class='heavy'>六四</b>，當位疑也。「匪寇，婚媾」，終无尤也。</p><p class='a'><b class='heavy'>六五</b>：賁於丘園，束帛戔戔。吝，終吉。<b>《象》</b>曰：<b class='heavy'>六五</b>之吉，有喜也。</p><p class='a'><b class='heavy'>上九</b>：白賁，无咎。<b>《象》</b>曰：「白賁，无咎」，上得志也。</p>"
    },
    {
        "c": "38",
        "d": "<h2><b class='g'>蠱</b>卦‘第十八’巽下艮上</h2><p>蠱：元亨，利涉大川。先甲三日，後甲三日。</p><p class='h2note'>《彖》曰：《蠱》，剛上而柔下，巽而止，蠱。《蠱》「元亨」，而天下治也。「利涉大川」，往有事也。「先甲三日，後甲三日」，終則有始，天行也。</p><p class='h2note'><b>《象》</b>曰：山下有風，蠱；君子以振民育德。</p><p class='a'><b class='heavy'>初六</b>：幹父之蠱，有子，考无咎。厲，終吉。<b>《象》</b>曰：「幹父之蠱」，意承考也。</p><p class='a'><b class='heavy'>九二</b>：幹母之蠱，不可貞。<b>《象》</b>曰：「幹母之蠱」，得中道也。</p><p class='a'><b class='heavy'>九三</b>：幹父之蠱，小有晦，无大咎。<b>《象》</b>曰：「幹父之蠱」，終无咎也。</p><p class='a'><b class='heavy'>六四</b>：裕父之蠱，往，見吝。<b>《象》</b>曰：「裕父之蠱」，往未得也。</p><p class='a'><b class='heavy'>六五</b>：幹父之蠱，用譽。<b>《象》</b>曰：「幹父」「用譽」；承以德也。</p><p class='a'><b class='heavy'>上九</b>：不事王侯，高尚其事。<b>《象》</b>曰：不事王侯，志可則也。</p>"
    },
    {
        "c": "39",
        "d": "<h2><b class='g'>大畜</b>卦‘第二十六’乾下艮上</h2><p>大畜：利貞。不家食，吉。利涉大川。</p><p class='h2note'>《彖》曰：《大畜》，剛健，篤實，輝光，日新其德。剛上而尚賢，能止健，大正也。「不家食，吉」，養賢也。「利涉大川」，應乎天也。</p><p class='h2note'><b>《象》</b>曰：天在山中，大畜；君子以多識前言往行以畜其德。</p><p class='a'><b class='heavy'>初九</b>：有厲。利已。<b>《象》</b>曰：「有厲」，「利已」，不犯災也。</p><p class='a'><b class='heavy'>九二</b>：輿說輹。<b>《象》</b>曰：「輿說輹」，中无尤也。</p><p class='a'><b class='heavy'>九三</b>：良馬逐，利艱貞。曰閑輿衛，利有攸往。<b>《象》</b>曰：「利有攸往」，上合志也。</p><p class='a'><b class='heavy'>六四</b>：童牛之牿，元吉。<b>《象》</b>曰：<b class='heavy'>六四</b>「元吉」，有喜也。</p><p class='a'><b class='heavy'>六五</b>：豶豕之牙，吉。<b>《象》</b>曰：<b class='heavy'>六五</b>之吉，有慶也。</p><p class='a'><b class='heavy'>上九</b>：何天之衢，亨。<b>《象》</b>曰：「何天之衢」，道大行也。</p>"
    },
    {
        "c": "40",
        "d": "<h2><b class='g'>晉</b>卦‘第三十五’坤下離上</h2><p>晉：康侯用錫馬蕃庶，晝日三接。</p><p class='h2note'>《彖》曰：《晉》，進也。明出地上，順而麗乎大明，柔進而上行，是以「康侯用錫馬蕃庶，晝日三接」也。</p><p class='h2note'><b>《象》</b>曰：明出地上，晉；君子以自昭明德。</p><p class='a'><b class='heavy'>初六</b>：晉如摧如，貞吉。罔孚，裕，无咎。<b>《象》</b>曰：「晉如摧如」；獨行正也。「裕，无咎」；未受命也。</p><p class='a'><b class='heavy'>六二</b>：晉如愁如，貞吉。受兹介福于其王母。<b>《象》</b>曰：「受兹介福」，以中正也。</p><p class='a'><b class='heavy'>六三</b>：眾允，悔亡。<b>《象》</b>曰：「眾允」之志，上行也。</p><p class='a'><b class='heavy'>九四</b>：晉如鼫鼠，貞厲。<b>《象》</b>曰：「鼫鼠，貞厲」，位不當也。</p><p class='a'><b class='heavy'>六五</b>：悔亡，失得，勿恤，往，吉，无不利。<b>《象》</b>曰：「失得，勿恤，往」，有慶也。</p><p class='a'><b class='heavy'>上九</b>：晉其角，維用伐邑。厲，吉。无咎，貞吝。<b>《象》</b>曰：「維用伐邑」，道未光也。</p>"
    },
    {
        "c": "41",
        "d": "<h2><b class='g'>噬嗑</b>卦‘第二十一’震下離上</h2><p>噬嗑：亨，利用獄。</p><p class='h2note'>《彖》曰：頤中有物，曰噬嗑。噬嗑而亨，剛柔分，動而明，雷電合而章，柔得中而上行。雖不當位，利用獄也。</p><p class='h2note'><b>《象》</b>曰：「雷電」「噬嗑」，先王以明罰敕法。</p><p class='a'><b class='heavy'>初九</b>：屨校滅趾，无咎。<b>《象》</b>曰：「屨校滅趾」，不行也。</p><p class='a'><b class='heavy'>六二</b>：噬膚滅鼻，无咎。<b>《象》</b>曰：「噬膚滅鼻」，乘剛也。</p><p class='a'><b class='heavy'>六三</b>：噬腊肉，遇毒，小吝，无咎。<b>《象》</b>曰：「遇毒」，位不當也。</p><p class='a'><b class='heavy'>九四</b>：噬乾胏，得金矢。利艱貞，吉。<b>《象》</b>曰：「利艱貞，吉」，未光也。</p><p class='a'><b class='heavy'>六五</b>：噬乾肉，得黃金。貞厲，无咎。<b>《象》</b>曰：「貞厲，无咎」，得當也。</p><p class='a'><b class='heavy'>上九</b>：何校滅耳，凶。<b>《象》</b>曰：「何校滅耳」，聰不明也。</p>"
    },
    {
        "c": "42",
        "d": "<h2><b class='g'>未濟</b>卦‘第六十四’坎下離上</h2><p>未濟：亨。小狐汔濟，濡其尾。无攸利。</p><p class='h2note'>《彖》曰：《未濟》「亨」，柔得中也。「小狐汔濟」，未出中也。「濡其尾，无攸利」，不續終也。雖不當位，剛柔應也。</p><p class='h2note'><b>《象》</b>曰：火在水上，未濟；君子以慎辨物居方。</p><p class='a'><b class='heavy'>初六</b>：濡其尾，吝。<b>《象》</b>曰：「濡其尾」，亦不知極也。</p><p class='a'><b class='heavy'>九二</b>：曳其輪，貞吉。<b>《象》</b>曰：<b class='heavy'>九二</b>「貞吉」，中以行正也。</p><p class='a'><b class='heavy'>六三</b>：未濟。征，凶。利涉大川。<b>《象》</b>曰：「未濟，征，凶」，位不當也。</p><p class='a'><b class='heavy'>九四</b>：貞吉。悔亡。震用伐鬼方，三年，有賞於大國。<b>《象》</b>曰：「貞吉，悔亡」，志行也。</p><p class='a'><b class='heavy'>六五</b>：貞吉。无悔。君子之光，有孚。吉。<b>《象》</b>曰：「君子之光」，其暉吉也。</p><p class='a'><b class='heavy'>上九</b>：有孚于飲酒，无咎。濡其首，有孚失是。<b>《象》</b>曰：飲酒濡首，亦不知節也。</p>"
    },
    {
        "c": "43",
        "d": "<h2><b class='g'>睽</b>卦‘第三十八’兌下離上</h2><p>睽：小事吉。</p><p class='h2note'>《彖》曰：《睽》，火動而上，澤動而下，二女同居，其志不同行。說而麗乎明，柔進而上行，得中而應乎剛，是以小事吉。天地睽而其事同也，男女睽而其志通也，萬物睽而其事類也。《睽》之時用大矣哉！</p><p class='h2note'><b>《象》</b>曰：上火下澤，睽；君子以同而異。</p><p class='a'><b class='heavy'>初九</b>：悔亡。喪馬勿逐，自復。見惡人，无咎。<b>《象》</b>曰：「見惡人」，以辟咎也。</p><p class='a'><b class='heavy'>九二</b>：遇主于巷，无咎。<b>《象》</b>曰：「遇主于巷」，未失道也。</p><p class='a'><b class='heavy'>六三</b>：見輿曳，其牛掣，其人天且劓。无初，有終。<b>《象》</b>曰：「見輿曳」，位不當也。「无初，有終」，遇剛也。</p><p class='a'><b class='heavy'>九四</b>：睽孤遇元夫，交孚。厲，无咎。<b>《象》</b>曰：「交孚」「无咎」，志行也。</p><p class='a'><b class='heavy'>六五</b>：悔亡。厥宗噬膚，往，何咎？<b>《象》</b>曰：「厥宗噬膚，往」，有慶也。</p><p class='a'><b class='heavy'>上九</b>：睽孤見豕負塗，載鬼一車。先張之弧，後說之弧。匪寇，婚媾。往遇雨，則吉。<b>《象》</b>曰：「遇雨」之吉，群疑亡也。</p>"
    },
    {
        "c": "44",
        "d": "<h2><b class='g'>旅</b>卦‘第五十六’艮下離上</h2><p>旅：小亨。旅貞吉。</p><p class='h2note'>《彖》曰：《旅》「小亨」，柔得中乎外而順乎剛，止而麗乎明，是以「小亨，旅貞吉」也。《旅》之時義大矣哉！</p><p class='h2note'><b>《象》</b>曰：山上有火，旅；君子以明慎用刑而不留獄。</p><p class='a'><b class='heavy'>初六</b>：旅瑣瑣，斯其所，取災。<b>《象》</b>曰：「旅瑣瑣」，志窮災也。</p><p class='a'><b class='heavy'>六二</b>：旅即次，懷其資。得童僕，貞。<b>《象》</b>曰：「得童僕，貞」，終无尤也。</p><p class='a'><b class='heavy'>九三</b>：旅焚其次，喪其童僕，貞厲。<b>《象》</b>曰：「旅焚其次」，亦以傷矣。以旅與下，其義喪也。</p><p class='a'><b class='heavy'>九四</b>：旅於處，得其資斧，我心不快。<b>《象》</b>曰：「旅於處」，未得位也。「得其資斧」，心未快也。</p><p class='a'><b class='heavy'>六五</b>：射雉一矢亡，終以譽命。<b>《象》</b>曰：「終以譽命」，上逮也。</p><p class='a'><b class='heavy'>上九</b>：鳥焚其巢，旅人先笑後號咷。喪牛于易。凶。<b>《象》</b>曰：以旅在上，其義焚也。「喪牛于易」，終莫之聞也。</p>"
    },
    {
        "c": "45",
        "d": "<h2><b class='g'>離</b>卦‘第三十’離下離上</h2><p>離：利貞，亨。畜牝牛，吉。</p><p class='h2note'>《彖》曰：離，麗也。日月麗乎天，百穀草木麗乎土，重明以麗乎正，乃化成天下。柔麗乎中正，故亨，是以「畜牝牛，吉」也。</p><p class='h2note'><b>《象》</b>曰：明兩作，離；大人以繼明照于四方。</p><p class='a'><b class='heavy'>初九</b>：履錯然，敬之，无咎。<b>《象》</b>曰：「履錯」之敬，以辟咎也。</p><p class='a'><b class='heavy'>六二</b>：黃離，元吉。<b>《象》</b>曰：「黃離，元吉」，得中道也。</p><p class='a'><b class='heavy'>九三</b>：日昃之離，不鼓缶而歌，則大耋之嗟，凶。<b>《象》</b>曰：「日昃之離」，何可久也？</p><p class='a'><b class='heavy'>九四</b>：突如其來如，焚如，死如，棄如。<b>《象》</b>曰：「突如其來如」，无所容也。</p><p class='a'><b class='heavy'>六五</b>：出涕沱若，戚嗟若，吉。<b>《象》</b>曰：<b class='heavy'>六五</b>之吉，離王公也。</p><p class='a'><b class='heavy'>上九</b>：王用出征有嘉。折首，獲匪其醜，无咎。<b>《象》</b>曰：「王用出征」，以正邦也。</p>"
    },
    {
        "c": "46",
        "d": "<h2><b class='g'>鼎</b>卦‘第五十’巽下離上</h2><p>鼎：元吉，亨。</p><p class='h2note'>《彖》曰：《鼎》，象也。以木巽火，亨飪也。聖人亨以享上帝，而大亨以養聖賢。巽而耳目聰明，柔進而上行，得中而應乎剛，是以元亨。</p><p class='h2note'><b>《象》</b>曰：木上有火，鼎；君子以正位凝命。</p><p class='a'><b class='heavy'>初六</b>：鼎顛趾，利出否。得妾以其子。无咎。<b>《象》</b>曰：「鼎顛趾」，未悖也。「利出否」，以從貴也。</p><p class='a'><b class='heavy'>九二</b>：鼎有實，我仇有疾，不我能即。吉。<b>《象》</b>曰：「鼎有實」，慎所之也。「我仇有疾」，終无尤也。</p><p class='a'><b class='heavy'>九三</b>：鼎耳革，其行塞。雉膏不食，方雨虧悔。終吉。<b>《象》</b>曰：「鼎耳革」，失其義也。</p><p class='a'><b class='heavy'>九四</b>：鼎折足，覆公餗，其形渥。凶。<b>《象》</b>曰：「覆公餗」，信如何也。</p><p class='a'><b class='heavy'>六五</b>：鼎黃耳金鉉，利貞。<b>《象》</b>曰：「鼎黃耳」，中以為實也。</p><p class='a'><b class='heavy'>上九</b>：鼎玉鉉，大吉，无不利。<b>《象》</b>曰：玉鉉在上，剛柔節也。</p>"
    },
    {
        "c": "47",
        "d": "<h2><b class='g'>大有</b>卦‘第十四’乾下離上</h2><p>大有：元亨。</p><p class='h2note'>《彖》曰：《大有》，柔得尊位大中而上下應之，曰大有。其德剛健而文明，應乎天而時行，是以元亨。</p><p class='h2note'><b>《象》</b>曰：火在天上，大有；君子以遏惡揚善，順天休命。</p><p class='a'><b class='heavy'>初九</b>：无交害，匪咎，艱則无咎。<b>《象》</b>曰：《大有·<b class='heavy'>初九</b>》，无交害也。</p><p class='a'><b class='heavy'>九二</b>：大車以載，有攸往，无咎。<b>《象》</b>曰：「大車以載」，積中不敗也。</p><p class='a'><b class='heavy'>九三</b>：公用亨于天子，小人弗克。<b>《象》</b>曰：「公用亨于天子」，小人害也。</p><p class='a'><b class='heavy'>九四</b>：匪其彭，无咎。<b>《象》</b>曰：「匪其彭，无咎」；明辨晢也。</p><p class='a'><b class='heavy'>六五</b>：厥孚交如威如，吉。<b>《象》</b>曰：「厥孚交如」，信以發志也。「威如」之吉，易而无備也。</p><p class='a'><b class='heavy'>上九</b>：自天祐之，吉，无不利。<b>《象》</b>曰：《大有》上吉，自天祐也。</p>"
    },
    {
        "c": "48",
        "d": "<h2><b class='g'>觀</b>卦‘第二十’坤下巽上</h2><p>觀：盥而不薦，有孚顒若。</p><p class='h2note'>《彖》曰：大觀在上，順而巽，中正以觀天下。《觀》「盥而不薦，有孚顒若」，下觀而化也。觀天之神道而四時不忒，聖人以神道設教而天下服矣。</p><p class='h2note'><b>《象》</b>曰：風行地上，觀；先王以省方觀民設教。</p><p class='a'><b class='heavy'>初六</b>：童觀，小人无咎，君子吝。<b>《象》</b>曰：<b class='heavy'>初六</b>「童觀」，小人道也。</p><p class='a'><b class='heavy'>六二</b>：闚觀，利女貞。<b>《象》</b>曰：「闚觀女貞」，亦可醜也。</p><p class='a'><b class='heavy'>六三</b>：觀我生，進退。<b>《象》</b>曰：「觀我生，進退」，未失道也。</p><p class='a'><b class='heavy'>六四</b>：觀國之光，利用賓于王。<b>《象》</b>曰：「觀國之光」，尚賓也。</p><p class='a'><b class='heavy'>九五</b>：觀我生，君子无咎。<b>《象》</b>曰：「觀我生」，觀民也。</p><p class='a'><b class='heavy'>上九</b>：觀其生，君子无咎。<b>《象》</b>曰：「觀其生」，志未平也。</p>"
    },
    {
        "c": "49",
        "d": "<h2><b class='g'>益</b>卦‘第四十二’震下巽上</h2><p>益：利有攸往。利涉大川。</p><p class='h2note'>《彖》曰：《益》，損上益下，民說无疆；自上下下，其道大光。「利有攸往」，中正有慶。「利涉大川」，木道乃行。益動而巽，日進无疆。天施地生，其益无方。凡《益》之道，與時偕行。</p><p class='h2note'><b>《象》</b>曰：風雷，益；君子以見善則遷，有過則改。</p><p class='a'><b class='heavy'>初九</b>：利用為大作，元吉，无咎。<b>《象》</b>曰：「元吉，无咎」，下不厚事也。</p><p class='a'><b class='heavy'>六二</b>：或益之十朋之龜，弗克違，永貞吉。王用享于帝，吉。<b>《象》</b>曰：「或益之」，自外來也。</p><p class='a'><b class='heavy'>六三</b>：益之用凶事，无咎。有孚，中行告公用圭。<b>《象》</b>曰：「益用凶事」，固有之也。</p><p class='a'><b class='heavy'>六四</b>：中行告公，從。利用為依遷國。<b>《象》</b>曰：「告公，從」，以益志也。</p><p class='a'><b class='heavy'>九五</b>：有孚，惠心勿問，元吉。有孚，惠我德。<b>《象》</b>曰：「有孚，惠心」，勿問之矣。「惠我德」，大得志也。</p><p class='a'><b class='heavy'>上九</b>：莫益之，或擊之。立心勿恒，凶。<b>《象》</b>曰：「莫益之」，偏辭也。「或擊之」，自外來也。</p>"
    },
    {
        "c": "50",
        "d": "<h2><b class='g'>渙</b>卦‘第五十九’坎下巽上</h2><p>渙：亨，王假有廟。利涉大川。利貞。</p><p class='h2note'>《彖》曰：《渙》「亨」，剛來而不窮，柔得位乎外而上同。「王假有廟」，王乃在中也。「利涉大川」，乘木有功也。</p><p class='h2note'><b>《象》</b>曰：風行水上，渙；先王以享于帝立廟。</p><p class='a'><b class='heavy'>初六</b>：用拯馬壯，吉。<b>《象》</b>曰：<b class='heavy'>初六</b>之吉，順也。</p><p class='a'><b class='heavy'>九二</b>：渙奔其机。悔亡。<b>《象》</b>曰：「渙奔其机」，得願也。</p><p class='a'><b class='heavy'>六三</b>：渙其躬，无悔。<b>《象》</b>曰：「渙其躬」，志在外也。</p><p class='a'><b class='heavy'>六四</b>：渙其群，元吉。渙有丘，匪夷所思。<b>《象》</b>曰：「渙其群，元吉」，光大也。</p><p class='a'><b class='heavy'>九五</b>：渙汗其大號，渙王居，无咎。<b>《象》</b>曰：「王居，无咎」，正位也。</p><p class='a'><b class='heavy'>上九</b>：渙其血去逖出，无咎。<b>《象》</b>曰：「渙其血」，遠害也。</p>"
    },
    {
        "c": "51",
        "d": "<h2><b class='g'>中孚</b>卦‘第六十一’兌下巽上</h2><p>中孚：豚魚吉。利涉大川。利貞。</p><p class='h2note'>《彖》曰：《中孚》，柔在內而剛得中，說而巽，孚乃化邦也。「豚魚吉」，信及豚魚也。「利涉大川」，乘木舟虛也。中孚以利貞，乃應乎天也。</p><p class='h2note'><b>《象》</b>曰：澤上有風，中孚；君子以議獄緩死。</p><p class='a'><b class='heavy'>初九</b>：虞，吉。有它，不燕。<b>《象》</b>曰：<b class='heavy'>初九</b>「虞，吉」，志未變也。</p><p class='a'><b class='heavy'>九二</b>：鳴鶴在陰，其子和之。我有好爵，吾與爾靡之。<b>《象》</b>曰：「其子和之」，中心願也。</p><p class='a'><b class='heavy'>六三</b>：得敵，或鼓或罷，或泣或歌。<b>《象》</b>曰：「或鼓或罷」，位不當也。</p><p class='a'><b class='heavy'>六四</b>：月幾望，馬匹亡。无咎。<b>《象》</b>曰：「馬匹亡」，絕類上也。</p><p class='a'><b class='heavy'>九五</b>：有孚攣如，无咎。<b>《象》</b>曰：「有孚攣如」，位正當也。</p><p class='a'><b class='heavy'>上九</b>：翰音登於天。貞，凶。<b>《象》</b>曰：「翰音登于天」，何可長也？</p>"
    },
    {
        "c": "52",
        "d": "<h2><b class='g'>漸</b>卦‘第五十三’艮下巽上</h2><p>漸：女歸，吉。利貞。</p><p class='h2note'>《彖》曰：《漸》之進也，女歸吉也。進得位，往有功也。進以正，可以正邦也。其位，剛得中也。止而巽，動不窮也。</p><p class='h2note'><b>《象》</b>曰：山上有木，漸；君子以居賢德善俗。</p><p class='a'><b class='heavy'>初六</b>：鴻漸于干，小子厲，有言，无咎。<b>《象》</b>曰：小子之厲，義无咎也。</p><p class='a'><b class='heavy'>六二</b>：鴻漸于磐，飲食衎衎。吉。<b>《象》</b>曰：「飲食衎衎」，不素飽也。</p><p class='a'><b class='heavy'>九三</b>：鴻漸于陸，夫征不復，婦孕不育。凶。利禦寇。<b>《象》</b>曰：「夫征不復」，離群醜也。「婦孕不育」，失其道也。「利用禦寇」，順相保也。</p><p class='a'><b class='heavy'>六四</b>：鴻漸于木，或得其桷。无咎。<b>《象》</b>曰：「或得其桷」，順以巽也。</p><p class='a'><b class='heavy'>九五</b>：鴻漸于陵，婦三歲不孕，終莫之勝，吉。<b>《象》</b>曰：「終莫之勝，吉」；得所願也。</p><p class='a'><b class='heavy'>上九</b>：鴻漸于陸，其羽可用為儀。吉。<b>《象》</b>曰：「其羽可用為儀，吉」，不可亂也。</p>"
    },
    {
        "c": "53",
        "d": "<h2><b class='g'>家人</b>卦‘第三十七’離下巽上</h2><p>家人：利女貞。</p><p class='h2note'>《彖》曰：《家人》，女正位乎內，男正位乎外，男女正，天地之大義也。家人有嚴君焉，父母之謂也。父父子子、兄兄弟弟、夫夫婦婦而家道正，正家而天下定矣。</p><p class='h2note'><b>《象》</b>曰：風自火出，家人；君子以言有物而行有恆。</p><p class='a'><b class='heavy'>初九</b>：閑有家，悔亡。<b>《象》</b>曰：「閑有家」，志未變也。</p><p class='a'><b class='heavy'>六二</b>：无攸遂，在中饋。貞吉。<b>《象》</b>曰：<b class='heavy'>六二</b>之吉，順以巽也。</p><p class='a'><b class='heavy'>九三</b>：家人嗃嗃，悔厲，吉。婦子嘻嘻，終吝。<b>《象》</b>曰：「家人嗃嗃」，未失也。「婦子嘻嘻」，失家節也。</p><p class='a'><b class='heavy'>六四</b>：富家，大吉。<b>《象》</b>曰：「富家，大吉」，順在位也。</p><p class='a'><b class='heavy'>九五</b>：王假有家，勿恤。吉。<b>《象》</b>曰：「王假有家」，交相愛也。</p><p class='a'><b class='heavy'>上九</b>：有孚，威如。終吉。<b>《象》</b>曰：「威如」之吉，反身之謂也。</p>"
    },
    {
        "c": "54",
        "d": "<h2><b class='g'>巽</b>卦‘第五十七’巽下巽上。</h2><p>巽：小亨。利有攸往。利見大人。</p><p class='h2note'>《彖》曰：重巽以申命，剛巽乎中正而志行，柔皆順乎剛，是以「小亨，利有攸往，利見大人」。</p><p class='h2note'><b>《象》</b>曰：隨風，巽；君子以申命行事。</p><p class='a'><b class='heavy'>初六</b>：進退，利武人之貞。<b>《象》</b>曰：「進退」，志疑也。「利武人之貞」，志治也。</p><p class='a'><b class='heavy'>九二</b>：巽在牀下，用史巫紛若。吉，无咎。<b>《象》</b>曰：「紛若」之吉，得中也。</p><p class='a'><b class='heavy'>九三</b>：頻巽，吝。<b>《象》</b>曰：「頻巽」之吝，志窮也。</p><p class='a'><b class='heavy'>六四</b>：悔亡。田獲三品。<b>《象》</b>曰：「田獲三品」，有功也。</p><p class='a'><b class='heavy'>九五</b>：貞吉。悔亡。无不利。无初，有終。先庚三日，後庚三日，吉。<b>《象》</b>曰：<b class='heavy'>九五</b>之吉，位正中也。</p><p class='a'><b class='heavy'>上九</b>：巽在牀下，喪其資斧。貞凶。<b>《象》</b>曰：「巽在牀下」，上窮也。「喪其資斧」，正乎凶也。</p>"
    },
    {
        "c": "55",
        "d": "<h2><b class='g'>小畜</b>卦‘第九’乾下巽上</h2><p>小畜：亨。密雲不雨，自我西郊。</p><p class='h2note'>《彖》曰：《小畜》，柔得位而上下應之，曰小畜。健而巽，剛中而志行，乃亨。「密雲不雨」，尚往也。「自我西郊」，施未行也。</p><p class='h2note'><b>《象》</b>曰：風行天上，小畜；君子以懿文德。</p><p class='a'><b class='heavy'>初九</b>：復自道，何其咎？吉。<b>《象》</b>曰：「復自道」，其義吉也。</p><p class='a'><b class='heavy'>九二</b>：牽復，吉。<b>《象》</b>曰：牽復在中，亦不自失也。</p><p class='a'><b class='heavy'>九三</b>：輿說輻，夫妻反目。<b>《象》</b>曰：「夫妻反目」，不能正室也。</p><p class='a'><b class='heavy'>六四</b>：有孚，血去惕出，无咎。<b>《象》</b>曰：「有孚」，「惕出」，上合志也。</p><p class='a'><b class='heavy'>九五</b>：有孚攣如，富以其鄰。<b>《象》</b>曰：「有孚攣如」，不獨富也。</p><p class='a'><b class='heavy'>上九</b>：既雨既處，尚德載。婦，貞厲。月幾望，君子征，凶。<b>《象》</b>曰：「既雨既處」，德積載也。「君子征，凶」，有所疑也。</p>"
    },
    {
        "c": "56",
        "d": "<h2><b class='g'>否</b>卦‘第十二’坤下乾上</h2><p>否之匪人，不利君子貞。大往小來。</p><p class='h2note'>《彖》曰：「否之匪人，不利君子貞」，「大往小來」，則是天地不交而萬物不通也，上下不交而天下无邦也，內陰而外陽，內柔而外剛，內小人而外君子，小人道長，君子道消也。</p><p class='h2note'><b>《象》</b>曰：天地不交，否；君子以儉德辟難，不可榮以祿。</p><p class='a'><b class='heavy'>初六</b>：拔茅茹以其彚，貞吉，亨。<b>《象》</b>曰：「拔茅」，「貞吉」，志在君也。</p><p class='a'><b class='heavy'>六二</b>：包承，小人吉，大人否，亨。<b>《象》</b>曰：「大人否，亨」，不亂群也。</p><p class='a'><b class='heavy'>六三</b>：包羞。<b>《象》</b>曰：「包羞」，位不當也。</p><p class='a'><b class='heavy'>九四</b>：有命，无咎，疇離祉。<b>《象》</b>曰：「有命，无咎」，志行也。</p><p class='a'><b class='heavy'>九五</b>：休否，大人吉。其亡其亡，繫于苞桑。<b>《象》</b>曰：大人之吉，位正當也。</p><p class='a'><b class='heavy'>上九</b>：傾否，先否後喜。<b>《象》</b>曰：否終則傾，何可長也。</p>"
    },
    {
        "c": "57",
        "d": "<h2><b class='g'>无妄</b>卦‘第二十五’震下乾上</h2><p>无妄：元亨，利貞。其匪正，有眚。不利有攸往。</p><p class='h2note'>《彖》曰：《无妄》，剛自外來而為主於內，動而健，剛中而應，大亨以正，天之命也。「其匪正，有眚，不利有攸往」，无妄之往，何之矣？天命不祐，行矣哉！</p><p class='h2note'><b>《象》</b>曰：天下雷行物與，无妄；先王以茂對時育萬物。</p><p class='a'><b class='heavy'>初九</b>：无妄往，吉。<b>《象》</b>曰：无妄之往，得志也。</p><p class='a'><b class='heavy'>六二</b>：不耕穫，不菑畬，則利有攸往。<b>《象》</b>曰：「不耕穫」，未富也。</p><p class='a'><b class='heavy'>六三</b>：无妄之災，或繫之牛，行人之得，邑人之災。<b>《象》</b>曰：行人得牛，邑人災也。</p><p class='a'><b class='heavy'>九四</b>：可貞，无咎。<b>《象》</b>曰：「可貞，无咎」，固有之也。</p><p class='a'><b class='heavy'>九五</b>：无妄之疾，勿藥有喜。<b>《象》</b>曰：无妄之藥，不可試也。</p><p class='a'><b class='heavy'>上九</b>：无妄行，有眚，无攸利。<b>《象》</b>曰：无妄之行，窮之災也。</p>"
    },
    {
        "c": "58",
        "d": "<h2><b class='g'>訟</b>卦‘第六’坎下乾上</h2><p>訟：有孚，窒惕，中吉，終凶。利見大人。不利涉大川。</p><p class='h2note'>《彖》曰：《訟》，上剛下險，險而健，訟。「訟，有孚，窒惕，中吉」，剛來而得中也。「終凶」，訟不可成也。「利見大人」，尚中正也。「不利涉大川」，入于淵也。</p><p class='h2note'><b>《象》</b>曰：天與水違行，訟；君子以作事謀始。</p><p class='a'><b class='heavy'>初六</b>：不永所事，小有言，終吉。<b>《象》</b>曰：「不永所事」，訟不可長也。雖有小言，其辯明也。</p><p class='a'><b class='heavy'>九二</b>：不克訟，歸，而逋其邑人三百戶，无眚。<b>《象》</b>曰：不克訟，歸逋竄也。自下訟上，患至掇也。</p><p class='a'><b class='heavy'>六三</b>：食舊德，貞厲，終吉。或從王事，无成。<b>《象》</b>曰：「食舊德」，從上吉也。</p><p class='a'><b class='heavy'>九四</b>：不克訟，復即命，渝；安貞，吉。<b>《象》</b>曰：「復即命，渝；安貞」；不失也。</p><p class='a'><b class='heavy'>九五</b>：訟，元吉。<b>《象》</b>曰：「訟，元吉」，以中正也。</p><p class='a'><b class='heavy'>上九</b>：或錫之鞶帶，終朝三褫之。<b>《象》</b>曰：以訟受服，亦不足敬也。</p>"
    },
    {
        "c": "59",
        "d": "<h2><b class='g'>履</b>卦‘第十’兌下乾上</h2><p>履虎尾，不咥人，亨。</p><p class='h2note'>《彖》曰：《履》，柔履剛也。說而應乎乾，是以「履虎尾，不咥人，亨」。剛中正，履帝位而不疚，光明也。</p><p class='h2note'><b>《象》</b>曰：上天下澤，履；君子以辨上下定民志。</p><p class='a'><b class='heavy'>初九</b>：素履，往，无咎。<b>《象》</b>曰：素履之往，獨行願也。</p><p class='a'><b class='heavy'>九二</b>：履道坦坦，幽人貞吉。<b>《象》</b>曰：「幽人貞吉」，中不自亂也。</p><p class='a'><b class='heavy'>六三</b>：眇能視，跛能履。履虎尾，咥人，凶。武人為于大君。<b>《象》</b>曰：「眇能視」；不足以有明也。「跛能履」；不足以與行也。咥人之凶，位不當也。「武人為于大君」；志剛也。</p><p class='a'><b class='heavy'>九四</b>：履虎尾，愬愬。終吉。<b>《象》</b>曰：「愬愬」，「終吉」，志行也。</p><p class='a'><b class='heavy'>九五</b>：夬履，貞厲。<b>《象》</b>曰：「夬履，貞厲」，位正當也。</p><p class='a'><b class='heavy'>上九</b>：視履，考祥，其旋，元吉。<b>《象》</b>曰：元吉在上，大有慶也。</p>"
    },
    {
        "c": "60",
        "d": "<h2><b class='g'>遯</b>卦‘第三十三’艮下乾上</h2><p>遯：亨，小利貞。</p><p class='h2note'>《彖》曰：「遯亨」，遯而亨也。剛當位而應，與時行也。「小利貞」，浸而長也。《遯》之時義大矣哉！</p><p class='h2note'><b>《象》</b>曰：天下有山，遯；君子以遠小人，不惡而嚴。</p><p class='a'><b class='heavy'>初六</b>：遯尾，厲。勿用有攸往。<b>《象》</b>曰：「遯尾」之厲，不往何災也。</p><p class='a'><b class='heavy'>六二</b>：執之用黃牛之革，莫之勝說。<b>《象》</b>曰：執用黃牛，固志也。</p><p class='a'><b class='heavy'>九三</b>：係遯，有疾，厲。畜臣妾，吉。<b>《象》</b>曰：係遯之厲，有疾憊也。「畜臣妾，吉」，不可大事也。</p><p class='a'><b class='heavy'>九四</b>：好遯，君子吉，小人否。<b>《象》</b>曰：君子好遯，小人否也。</p><p class='a'><b class='heavy'>九五</b>：嘉遯，貞吉。<b>《象》</b>曰：「嘉遯，貞吉」，以正志也。<b class='heavy'>上九</b>：肥遯，无不利。<b>《象》</b>曰：「肥遯，无不利」，无所疑也。</p>"
    },
    {
        "c": "61",
        "d": "<h2><b class='g'>同人</b>卦‘第十三’離下乾上</h2><p>同人於野，亨，利涉大川，利君子貞。</p><p class='h2note'>《彖》曰：《同人》，柔得位得中而應乎乾，曰同人。《同人》曰「同人于野，亨，利涉大川」，乾行也。文明以健，中正而應，君子正也。唯君子為能通天下之志。</p><p class='h2note'><b>《象》</b>曰：天與火，同人；君子以類族辨物。</p><p class='a'><b class='heavy'>初九</b>：同人于門，无咎。<b>《象》</b>曰：出門同人，又誰咎也。</p><p class='a'><b class='heavy'>六二</b>：同人于宗，吝。<b>《象》</b>曰：「同人于宗」，吝道也。</p><p class='a'><b class='heavy'>九三</b>：伏戎于莽，升其高陵，三歲不興。<b>《象》</b>曰：「伏戎于莽」，敵剛也。「三歲不興」，安行也。</p><p class='a'><b class='heavy'>九四</b>：乘其墉，弗克攻，吉。<b>《象》</b>曰：「乘其墉」，義弗克也。其吉，則困而反則也。</p><p class='a'><b class='heavy'>九五</b>：同人先號咷而後笑，大師克相遇。<b>《象》</b>曰：同人之先，以中直也。大師相遇，言相克也。</p><p class='a'><b class='heavy'>上九</b>：同人于郊，无悔。<b>《象》</b>曰：「同人于郊」，志未得也。</p>"
    },
    {
        "c": "62",
        "d": "<h2><b class='g'>姤</b>卦‘第四十四’巽下乾上</h2><p>姤：女壯，勿用取女。</p><p class='h2note'>《彖》曰：《姤》，遇也，柔遇剛也。「勿用取女」，不可與長也。天地相遇，品物咸章也。剛遇中正，天下大行也。《姤》之時義大矣哉！</p><p class='h2note'><b>《象》</b>曰：天下有風，姤；后以施命誥四方。</p><p class='a'><b class='heavy'>初六</b>：繫于金柅，貞吉。有攸往，見凶，羸豕蹢躅。<b>《象》</b>曰：「繫于金柅」，柔道牽也。</p><p class='a'><b class='heavy'>九二</b>：包有魚。无咎，不利賓。<b>《象》</b>曰：「包有魚」，義不及賓也。</p><p class='a'><b class='heavy'>九三</b>：臀无膚，其行次且。厲，无大咎。<b>《象》</b>曰：「其行次且」，行未牽也。</p><p class='a'><b class='heavy'>九四</b>：包无魚，起凶。<b>《象》</b>曰：「无魚」之凶，遠民也。</p><p class='a'><b class='heavy'>九五</b>：以杞包瓜，含章，有隕自天。<b>《象》</b>曰：<b class='heavy'>九五</b>「含章」，中正也。「有隕自天」，志不舍命也。</p><p class='a'><b class='heavy'>上九</b>：姤其角，吝，无咎。<b>《象》</b>曰：「姤其角」，上窮吝也。</p>"
    },
    {
        "c": "63",
        "d": "<h2><b class='g'>乾</b>卦‘第一’乾下乾上</h2><p>乾：元亨，利貞。</p><p class='a'><b class='heavy'>初九</b>：潛龍，勿用。</p><p class='a'><b class='heavy'>九二</b>：見龍在田，利見大人。</p><p class='a'><b class='heavy'>九三</b>：君子終日乾乾，夕惕若；厲，无咎。</p><p class='a'><b class='heavy'>九四</b>：或躍在淵，无咎。</p><p class='a'><b class='heavy'>九五</b>：飛龍在天，利見大人。</p><p class='a'><b class='heavy'>上九</b>：亢龍，有悔。</p><p class='a'>用九：見群龍无首，吉。</p><p class='h2note'>《彖》曰：大哉乾元，萬物資始，乃統天。雲行雨施，品物流形，大明終始，六位時成，時乘六龍以禦天。乾道變化，各正性命。保合太和，乃利貞。首出庶物，萬國咸寧。</p><p class='h2note'><b>《象》</b>曰：天行健，君子以自强不息。</p><p class='a'>「潛龍，勿用」，陽在下也。「見龍在田」，德施普也。「終日乾乾」，反復道也。「或躍在淵」，進无咎也。「飛龍在天」，大人造也。「亢龍有悔」，盈不可久也。「用九」，天德不可為首也。</p><p class='a'><b>《文言》</b>曰：元者，善之長也。亨者，嘉之會也。利者，義之和也。貞者，事之幹也。君子體仁足以長人，嘉會足以合禮，利物足以和義，貞固足以幹事。君子，行此四德者，故曰：「乾：元，亨，利，貞」。</p><p class='a'><b class='heavy'>初九</b>曰「潛龍，勿用」，何謂也？子曰：「龍德而隱者也。不易乎世，不成乎名；遯世无悶，不見是而无悶；樂則行之，憂則違之，確乎其不可拔，潛龍也。」<b class='heavy'>九二</b>曰「見龍在田，利見大人」，何謂也？子曰：「龍德而正中者也。庸言之信，庸行之謹，閑邪存其誠，善世而不伐；德博而化。<b>《易》</b>曰：『見龍在田，利見大人。』君德也。」<b class='heavy'>九三</b>曰「君子終日乾乾，夕惕若；厲，无咎」，何謂也？子曰：「君子進德脩業。忠信，所以進德也。脩辭立其誠，所以居業也。知至至之，可與幾也。知終終之，可與存義也。是故居上位而不驕，在下位而不憂。故乾乾因其時而惕，雖危无咎矣。」<b class='heavy'>九四</b>曰「或躍在淵，无咎」，何謂也？子曰：「上下无常，非為邪也。進退无恒，非離群也。君子進德脩業，欲及時也，故无咎。」<b class='heavy'>九五</b>曰「飛龍在天，利見大人」，何謂也？子曰：「同聲相應，同氣相求。水流濕，火就燥。雲從龍，風從虎。聖人作而萬物覩。本乎天者親上，本乎地者親下，則各從其類也。」<b class='heavy'>上九</b>曰「亢龍有悔」，何謂也？子曰：「貴而无位，高而无民，賢人在下而无輔，是以動而有悔也。」</p><p class='a'>「乾龍，勿用」，下也。「見龍在田」，時舍也。「終日乾乾」，行事也。「或躍在淵」，自試也。「飛龍在天」，上治也。「亢龍有悔」，窮之災也。乾元用九，天下治也。</p><p class='a'>「乾龍，勿用」，陽氣潛藏。「見龍在田」，天下文明。「終日乾乾」，與時偕行。「或躍在淵」，乾道乃革。「飛龍在天」，乃位乎天德。「亢龍，有悔」，與時偕極。乾元用九，乃見天則。</p><p class='a'>乾元者，始而亨者也。利貞者，性情也。乾始能以美利利天下，不言所利，大矣哉！大哉乾乎！剛健中正，純粹精也。六爻發揮，旁通情也。「時乘六龍」，以禦天也。「雲行雨施」，天下平也。</p><p class='a'>君子以成德為行，日可見之行也。「潛」之為言也，隱而未見，行而未成，是以君子弗用也。君子學以聚之，問以辯之，寬以居之，仁以行之。<b>《易》</b>曰：「『見龍在田，利見大人』，君德也。」<b class='heavy'>九三</b>，重剛而不中，上不在天，下不在田，故乾乾因其時而惕，雖危无咎矣。<b class='heavy'>九四</b>，重剛而不中，上不在天，下不在田，中不在人，故「或」之；「或」之者，疑之也，故无咎。夫「大人」者，與天地合其德，與日月合其明，與四時合其序，與鬼神合其吉凶，先天而天弗違，後天而奉天時；天且弗違，而況於人乎？況於鬼神乎？「亢」之為言也，知進而不知退，知存而不知亡，知得而不知喪。其唯聖人乎！知進退存亡而不失其正者，其唯聖人乎！</p>"
    }
]



/* 
const s2t = function(stri) {
    var k = '';
    for (var i = 0; i < stri.length; i++) k += (s.indexOf(stri.charAt(i)) == -1) ? stri.charAt(i) : t.charAt(s.indexOf(stri.charAt(i)))
    return k;
} */



export default {
    guaFullName,
    guaName,
    guaNameT,
    zhouyi,
    zhouyiGuas,
    t2s,
}